{"name": "ICLR_2017_163.pdf", "metadata": {"source": "CRF", "title": null, "authors": ["DEEP LEARNING", "Moritz Hardt", "Tengyu Ma"], "emails": ["m@mrtz.org", "tengyu@cs.princeton.edu"], "sections": [{"heading": null, "text": "An emerging design principle in deep learning is that each layer of a deep artificial neural network should be able to easily express the identity transformation. This idea not only motivated various normalization techniques, such as batch normalization, but was also key to the immense success of residual networks. In this work, we put the principle of identity parameterization on a more solid theoretical footing alongside further empirical progress. We first give a strikingly simple proof that arbitrarily deep linear residual networks have no spurious local optima. The same result for feed-forward networks in their standard parameterization is substantially more delicate. Second, we show that residual networks with ReLu activations have universal finite-sample expressivity in the sense that the network can represent any function of its sample provided that the model has more parameters than the sample size. Directly inspired by our theory, we experiment with a radically simple residual architecture consisting of only residual convolutional layers and ReLu activations, but no batch normalization, dropout, or max pool. Our model improves significantly on previous all-convolutional networks on the CIFAR10, CIFAR100, and ImageNet classification benchmarks."}, {"heading": "1 INTRODUCTION", "text": "Traditional convolutional neural networks for image classification, such as AlexNet (Krizhevsky et al. (2012)), are parameterized in such a way that when all trainable weights are 0, a convolutional layer represents the 0-mapping. Moreover, the weights are initialized symmetrically around 0. This standard parameterization makes it non-trivial for a convolutional layer trained with stochastic gradient methods to preserve features that were already good. Put differently, such convolutional layers cannot easily converge to the identity transformation at training time.\nThis shortcoming was observed and partially addressed by Ioffe & Szegedy (2015) through batch normalization, i.e., layer-wise whitening of the input with a learned mean and covariance. But the idea remained somewhat implicit until residual networks (He et al. (2015); He et al. (2016)) explicitly introduced a reparameterization of the convolutional layers such that when all trainable weights are 0, the layer represents the identity function. Formally, for an input x, each residual layer has the form x + h(x), rather than h(x). This simple reparameterization allows for much deeper architectures largely avoiding the problem of vanishing (or exploding) gradients. Residual networks, and subsequent architectures that use the same parameterization, have since then consistently achieved state-of-the-art results on various computer vision benchmarks such as CIFAR10 and ImageNet."}, {"heading": "1.1 OUR CONTRIBUTIONS", "text": "In this work, we consider identity parameterizations from a theoretical perspective, while translating some of our theoretical insight back into experiments. Loosely speaking, our first result underlines how identity parameterizations make optimization easier, while our second result shows the same is true for representation.\nLinear residual networks. Since general non-linear neural networks, are beyond the reach of current theoretical methods in optimization, we consider the case of deep linear networks as a simplified model. A linear network represents an arbitrary linear map as a sequence of matrices A` · · ·A2A1. The objective function is E‖y − A` · · ·A1x‖2, where y = Rx for some unknown linear transformation R and x is drawn from a distribution. Such linear networks have been studied actively in recent years as a stepping stone toward the general non-linear case (see Section 1.2). Even though A` · · ·A1 is just a linear map, the optimization problem over the factored variables (A`, . . . , A1) is non-convex.\nIn analogy with residual networks, we will instead parameterize the objective function as\nmin A1,...,A`\nE‖y − (I +A`) · · · (I +A1)x‖2 . (1.1)\nTo give some intuition, when the depth ` is large enough, we can hope that the target function R has a factored representation in which each matrix Ai has small norm. Any symmetric positive semidefinite matrix O can, for example, be written as a product O = O` · · ·O1, where each Oi = O1/` is very close to the identity for large ` so that Ai = Oi − I has small spectral norm. We first prove that an analogous claim is true for all linear transformations R. Specifically, we prove that for every linear transformation R, there exists a global optimizer (A1, . . . , A`) of (1.1) such that for large enough depth `,\nmax 1≤i≤`\n‖Ai‖ ≤ O(1/`). (1.2)\nHere, ‖A‖ denotes the spectral norm of A. The constant factor depends on the conditioning of R. We give the formal statement in Theorem 2.1. The theorem has the interesting consequence that as the depth increases, smaller norm solutions exist and hence regularization may offset the increase in parameters.\nHaving established the existence of small norm solutions, our main result on linear residual networks shows that the objective function (1.1) is, in fact, easy to optimize when all matrices have sufficiently small norm. More formally, letting A = (A1, . . . , A`) and f(A) denote the objective function in (1.1), we can show that the gradients of vanish only when f(A) = 0 provided that maxi ‖Ai‖ ≤ O(1/`). See Theorem 2.2. This result implies that linear residual networks have no critical points other than the global optimum. In contrast, for standard linear neural networks we only know, by work of Kawaguchi (2016) that these networks don’t have local optima except the global optimum, but it doesn’t rule out other critical points. In fact, setting Ai = 0 will always lead to a bad critical point in the standard parameterization.\nUniversal finite sample expressivity. Going back to non-linear residual networks with ReLU activations, we can ask: How expressive are deep neural networks that are solely based on residual layers with ReLU activations? To answer this question, we give a very simple construction showing that such residual networks have perfect finite sample expressivity. In other words, a residual network with ReLU activations can easily express any functions of a sample of size n, provided that it has sufficiently more than n parameters. Note that this requirement is easily met in practice. On CIFAR 10 (n = 50000), for example, successful residual networks often have more than 106 parameters. More formally, for a data set of size nwith r classes, our construction requiresO(n log n+r2) parameters. Theorem 3.2 gives the formal statement.\nEach residual layer in our construction is of the form x + V ReLU(Ux), where U and V are linear transformations. These layers are significantly simpler than standard residual layers, which typically have two ReLU activations as well as two instances of batch normalization.\nThe power of all-convolutional residual networks. Directly inspired by the simplicity of our expressivity result, we experiment with a very similar architecture on the CIFAR10, CIFAR100, and ImageNet data sets. Our architecture is merely a chain of convolutional residual layers each with a single ReLU activation, but without batch normalization, dropout, or max pooling as are common in standard architectures. The last layer is a fixed random projection that is not trained. In line with our theory, the convolutional weights are initialized near 0, using Gaussian noise mainly as a symmetry breaker. The only regularizer is standard weight decay (`2-regularization) and there is no need for dropout. Despite its simplicity, our architecture reaches 6.38% top-1 classification error on the CIFAR10 benchmark (with standard data augmentation). This is competitive with the best\nresidual network reported in He et al. (2015), which achieved 6.43%. Moreover, it improves upon the performance of the previous best all-convolutional network, 7.25%, achieved by Springenberg et al. (2014). Unlike ours, this previous all-convolutional architecture additionally required dropout and a non-standard preprocessing (ZCA) of the entire data set. Our architecture also improves significantly upon Springenberg et al. (2014) on both Cifar100 and ImageNet."}, {"heading": "1.2 RELATED WORK", "text": "Since the advent of residual networks (He et al. (2015); He et al. (2016)), most state-of-the-art networks for image classification have adopted a residual parameterization of the convolutional layers. Further impressive improvements were reported by Huang et al. (2016) with a variant of residual networks, called dense nets. Rather than adding the original input to the output of a convolutional layer, these networks preserve the original features directly by concatenation. In doing so, dense nets are also able to easily encode an identity embedding in a higher-dimensional space. It would be interesting to see if our theoretical results also apply to this variant of residual networks.\nThere has been recent progress on understanding the optimization landscape of neural networks, though a comprehensive answer remains elusive. Experiments in Goodfellow et al. (2014) and Dauphin et al. (2014) suggest that the training objectives have a limited number of bad local minima with large function values. Work by Choromanska et al. (2015) draws an analogy between the optimization landscape of neural nets and that of the spin glass model in physics (Auffinger et al. (2013)). Soudry & Carmon (2016) showed that 2-layer neural networks have no bad differentiable local minima, but they didn’t prove that a good differentiable local minimum does exist. Baldi & Hornik (1989) and Kawaguchi (2016) show that linear neural networks have no bad local minima. In contrast, we show that the optimization landscape of deep linear residual networks has no bad critical point, which is a stronger and more desirable property. Our proof is also notably simpler illustrating the power of re-parametrization for optimization. Our results also indicate that deeper networks may have more desirable optimization landscapes compared with shallower ones."}, {"heading": "2 OPTIMIZATION LANDSCAPE OF LINEAR RESIDUAL NETWORKS", "text": "Consider the problem of learning a linear transformation R : Rd → Rd from noisy measurements y = Rx+ ξ, where ξ ∈ N (0, Idd) is a d-dimensional spherical Gaussian vector. Denoting by D the distribution of the input data x, let Σ = Ex∼D[xx>] be its covariance matrix.\nThere are, of course, many ways to solve this classical problem, but our goal is to gain insights into the optimization landscape of neural nets, and in particular, residual networks. We therefore parameterize our learned model by a sequence of weight matrices A1, . . . , A` ∈ Rd×d,\nh0 = x , hj = hj−1 +Ajhj−1 , ŷ = h` . (2.1)\nHere h1, . . . , h`−1 are the ` − 1 hidden layers and ŷ = h` are the predictions of the learned model on input x. More succinctly, we have\nŷ = (Idd +A`) . . . (Id +A1)x .\nIt is easy to see that this model can express any linear transformationR.We will useA as a shorthand for all of the weight matrices, that is, the ` × d × d-dimensional tensor the contains A1, . . . , A` as slices. Our objective function is the maximum likelihood estimator,\nf(A, (x, y)) = ‖ŷ − y‖2 = ‖(Id +A`) . . . (Id +A1)x−Rx− ξ‖2 . (2.2) We will analyze the landscape of the population risk, defined as,\nf(A) := E [f(A, (x, y))] .\nRecall that ‖Ai‖ is the spectral norm ofAi. We define the norm |||·||| for the tensorA as the maximum of the spectral norms of its slices,\n|||A||| := max 1≤i≤` ‖Ai‖ .\nThe first theorem of this section states that the objective function f has an optimal solution with small |||·|||-norm, which is inversely proportional to the number of layers `. Thus, when\nthe architecture is deep, we can shoot for fairly small norm solutions. We define γ := max{| log σmax(R)|, | log σmin(R)|}. Here σmin(·), σmax(·) denote the least and largest singular values of R respectively. Theorem 2.1. Suppose ` ≥ 3γ. Then, there exists a global optimum solution A? of the population risk f(·) with norm\n|||A?||| ≤ 2( √ π + √ 3γ)2/` .\nHere γ should be thought of as a constant since if R is too large (or too small), we can scale the data properly so that σmin(R) ≤ 1 ≤ σmax(R). Concretely, if σmax(R)/σmin(R) = κ, then we can scaling for the outputs properly so that σmin(R) = 1/ √ κ and σmax(R) = √ κ. In this case, we\nhave γ = log √ κ, which will remain a small constant for fairly large condition number κ. We also point out that we made no attempt to optimize the constant factors here in the analysis. The proof of Theorem 2.1 is rather involved and is deferred to Section A.\nGiven the observation of Theorem 2.1, we restrict our attention to analyzing the landscape of f(·) in the set of A with |||·|||-norm less than τ ,\nBτ = {A ∈ R`×d×d : |||A||| ≤ τ} .\nHere using Theorem 2.1, the radius τ should be thought of as on the order of 1/`. Our main theorem in this section claims that there is no bad critical point in the domain Bτ for any τ < 1. Recall that a critical point has vanishing gradient. Theorem 2.2. For any τ < 1, we have that any critical point A of the objective function f(·) inside the domain Bτ must also be a global minimum.\nTheorem 2.2 suggests that it is sufficient for the optimizer to converge to critical points of the population risk, since all the critical points are also global minima.\nMoreover, in addition to Theorem 2.2, we also have that any A inside the domain Bτ satisfies that\n‖∇f(A)‖2F ≥ 4`(1− τ) `−1σmin(Σ) 2(f(A)− Copt) . (2.3)\nHere Copt is the global minimal value of f(·) and ‖∇f(A)‖F denotes the euclidean norm1 of the `× d× d-dimensional tensor∇f(A). Note that σmin(Σ) denote the minimum singular value of Σ. Equation (2.3) says that the gradient has fairly large norm compared to the error, which guarantees convergence of the gradient descent to a global minimum (Karimi et al. (2016)) if the iterates stay inside the domain Bτ , which is not guaranteed by Theorem 2.2 by itself. Towards proving Theorem 2.2, we start off with a simple claim that simplifies the population risk. We also use ‖·‖F to denote the Frobenius norm of a matrix. Claim 2.3. In the setting of this section, we have,\nf(A) = ∥∥∥((Id +A`) . . . (Id +A1)−R)Σ1/2∥∥∥2\nF + C . (2.4)\nHere C is a constant that doesn’t depend on A, and Σ1/2 denote the square root of Σ, that is, the unique symmetric matrix B that satisfies B2 = Σ.\nProof of Claim 2.3. Let tr(A) denotes the trace of the matrixA. LetE = (Id+A`) . . . (Id+A1)−R. Recalling the definition of f(A) and using equation (2.2), we have\nf(A) = E [ ‖Ex− ξ‖2 ] (by equation (2.2))\n= E [ ‖Ex‖2 + ‖ξ‖2 − 2〈Ex, ξ〉 ] = E [ tr(Exx>E>) ] + E [ ‖ξ‖2 ] (since E [〈Ex, ξ〉] = E [〈Ex,E [ξ|x]〉] = 0)\n= tr ( E E [ xx> ] E> ) + C (where C = E[xx>])\n= tr(EΣE>) + C = ‖EΣ1/2‖2F + C . (since E [ xx> ] = Σ)\n1That is, ‖T‖F := √∑ ijk T 2 ijk.\nNext we compute the gradients of the objective function f(·) from straightforward matrix calculus. We defer the full proof to Section A. Lemma 2.4. The gradients of f(·) can be written as,\n∂f\n∂Ai = 2(Id +A>` ) . . . (Id +A > i+1)EΣ(Id +A > i−1) . . . (Id +A > 1 ) , (2.5)\nwhere E = (Id +A`) . . . (Id +A1)−R .\nNow we are ready to prove Theorem 2.2. The key observation is that each matric Aj has small norm and cannot cancel the identity matrix. Therefore, the gradients in equation (2.5) is a product of non-zero matrices, except for the error matrix E. Therefore, if the gradient vanishes, then the only possibility is that the matrix E vanishes, which in turns implies A is an optimal solution.\nProof of Theorem 2.2. Using Lemma 2.4, we have,∥∥∥∥ ∂f∂Ai ∥∥∥∥ F = 2 ∥∥(Id +A>` ) . . . (Id +A>i+1)EΣ(Id +A>i−1) . . . (Id +A>1 )∥∥F (by Lemma 2.4)\n≥ 2 ∏ j 6=i σmin(Id +A>i ) · σmin(Σ)‖E‖F (by Claim C.2)\n≥ 2(1− τ)`−1σmin(Σ)‖E‖ . (since σmin(Id +A) ≥ 1− ‖A‖) It follows that\n‖∇f(A)‖2F = ∑̀ i=1 ∥∥∥∥ ∂f∂Ai ∥∥∥∥2 F ≥ 4`(1− τ)`−1σmin(Σ)2‖E‖2\n≥ 4`(1− τ)`−1σmin(Σ)2(f(A)− C) (by the definition of E and Claim 2.3) ≥ 4`(1− τ)`−1σmin(Σ)2(f(A)− Copt) .\n(since Copt = minA f(A) ≥ C by Claim 2.3)\nTherefore we complete the proof of equation (2.3). Finally, ifA is a critical point, namely,∇f(A) = 0, then by equation (2.3) we have that f(A) = Copt. That is, A is a global minimum."}, {"heading": "3 REPRESENTATIONAL POWER OF THE RESIDUAL NETWORKS", "text": "In this section we characterize the finite-sample expressivity of residual networks. We consider a residual layers with a single ReLU activation and no batch normalization. The basic residual building block is a function TU,V,s(·) : Rk → Rk that is parameterized by two weight matrices U ∈ R×k, V ∈ Rk×k and a bias vector s ∈ Rk,\nTU,V,s(h) = V ReLu(Uh+ s) . (3.1) A residual network is composed of a sequence of such residual blocks. In comparison with the full pre-activation architecture in He et al. (2016), we remove two batch normalization layers and one ReLU layer in each building block.\nWe assume the data has r labels, encoded as r standard basis vectors in Rr, denoted by e1, . . . , er. We have n training examples (x(1), y(1)), . . . , (x(n), y(n)), where x(i) ∈ Rd denotes the i-th data and y(i) ∈ {e1, . . . , er} denotes the i-th label. Without loss of generality we assume the data are normalized so that x(i) = 1. We also make the mild assumption that no two data points are very close to each other. Assumption 3.1. We assume that for every 1 ≤ i < j ≤ n, we have ‖x(i) − x(j)‖2 ≥ ρ for some absolute constant ρ > 0.\nImages, for example, can always be imperceptibly perturbed in pixel space so as to satisfy this assumption for a small but constant ρ.\nUnder this mild assumption, we prove that residual networks have the power to express any possible labeling of the data as long as the number of parameters is a logarithmic factor larger than n.\nTheorem 3.2. Suppose the training examples satisfy Assumption 3.1. Then, there exists a residual network N (specified below) with O(n log n + r2) parameters that perfectly expresses the training data, i.e., for all i ∈ {1, . . . , n}, the network N maps x(i) to y(i).\nIt is common in practice that n > r2, as is for example the case for the Imagenet data set where n > 106 and r = 1000.\nWe construct the following residual net using the building blocks of the form TU,V,s as defined in equation (3.1). The network consists of `+ 1 hidden layers h0, . . . , h`, and the output is denoted by ŷ ∈ Rr. The first layer of weights matricesA0 maps the d-dimensional input to a k-dimensional hidden variable h0. Then we apply ` layers of building block T with weight matrices Aj , Bj ∈ Rk×k. Finally, we apply another layer to map the hidden variable h` to the label ŷ in Rk. Mathematically, we have\nh0 = A0x ,\nhj = hj−1 + TAj ,Bj ,bj (hj−1), ∀j ∈ {1, . . . , `} ŷ = h` + TA`+1,B`+1,s`+1(h`) .\nWe note that here A`+1 ∈ Rk×r and B`+1 ∈ Rr×r so that the dimension is compatible. We assume the number of labels r and the input dimension d are both smaller than n, which is safely true in practical applications.2 The hyperparameter k will be chosen to be O(log n) and the number of layers is chosen to be ` = dn/ke. Thus, the first layer has dk parameters, and each of the middle ` building blocks contains 2k2 parameters and the final building block has kr+r2 parameters. Hence, the total number of parameters is O(kd+ `k2 + rk + r2) = O(n log n+ r2).\nTowards constructing the network N of the form above that fits the data, we first take a random matrix A0 ∈ Rk×d that maps all the data points x(i) to vectors h(i)0 := A0x(i). Here we will use h (i) j to denote the j-th layer of hidden variable of the i-th example. By Johnson-Lindenstrauss Theorem (Johnson & Lindenstrauss (1984), or see Wikipedia (2016)), with good probability, the resulting vectors h(i)0 ’s remain to satisfy Assumption 3.1 (with slightly different scaling and larger constant ρ), that is, any two vectors h(i)0 and h (j) 0 are not very correlated.\nThen we construct ` middle layers that maps h(i)0 to h (i) ` for every i ∈ {1, . . . , n}. These vectors h (i) ` will clustered into r groups according to the labels, though they are in the Rk instead of in Rr as desired. Concretely, we design this cluster centers by picking r random unit vectors q1, . . . , qr in Rk. We view them as the surrogate label vectors in dimension k (note that k is potentially much smaller than r). In high dimensions (technically, if k > 4 log r) random unit vectors q1, . . . , qr are pair-wise uncorrelated with inner product less than < 0.5. We associate the i-th example with the target surrogate label vector v(i) defined as follows,\nif y(i) = ej , then v(i) = qj . (3.2)\nThen we will construct the matrices (A1, B1), . . . , (A`, B`) such that the first ` layers of the network maps vector h(i)0 to the surrogate label vector v\n(i). Mathematically, we will construct (A1, B1), . . . , (A`, B`) such that\n∀i ∈ {1, . . . , n}, h(i)` = v (i) . (3.3)\nFinally we will construct the last layer TA`+1,B`+1,b`+1 so that it maps the vectors q1, . . . , qr ∈ Rk to e1, . . . , er ∈ Rr,\n∀j ∈ {1, . . . , r}, qj + TA`+1,B`+1,b`+1(qj) = ej . (3.4) Putting these together, we have that by the definition (3.2) and equation (3.3), for every i, if the label is y(i) is ej , then h (i) ` will be qj . Then by equation (3.4), we have that ŷ (i) = qj + TA`+1,B`+1,b`+1(qj) = ej . Hence we obtain that ŷ(i) = y(i).\nThe key part of this plan is the construction of the middle ` layers of weight matrices so that h(i)` = v(i). We encapsulate this into the following informal lemma. The formal statement and the full proof is deferred to Section B.\n2In computer vision, typically r is less than 103 and d is less than 105 while n is larger than 106\nLemma 3.3 (Informal version of Lemma B.2). In the setting above, for (almost) arbitrary vectors h(1)0 , . . . , h (n) 0 and v\n(1), . . . , v(n) ∈ {q1, . . . , qr}, there exists weights matrices (A1, B1), . . . , (A`, B`), such that,\n∀i ∈ {1, . . . , n}, h(i)` = v (i) .\nWe briefly sketch the proof of the Lemma to provide intuitions, and defer the full proof to Section B. The operation that each residual block applies to the hidden variable can be abstractly written as,\nĥ→ h+ TU,V,s(h) . (3.5)\nwhere h corresponds to the hidden variable before the block and ĥ corresponds to that after. We claim that for an (almost) arbitrary sequence of vectors h(1), . . . , h(n), there exist TU,V,s(·) such that operation (3.5) transforms k vectors of h(i)’s to an arbitrary set of other k vectors that we can freely choose, and maintain the value of the rest of n − k vectors. Concretely, for any subset S of size k, and any desired vector v(i)(i ∈ S), there exist U, V, s such that\nv(i) = h(i) + TU,V,s(h(i)) ∀i ∈ S h(i) = h(i) + TU,V,s(h(i)) ∀i 6∈ S (3.6)\nThis claim is formalized in Lemma B.1. We can use it repeatedly to construct ` layers of building blocks, each of which transforms a subset of k vectors in {h(1)0 , . . . , h (n) 0 } to the corresponding vectors in {v(1), . . . , v(n)}, and maintains the values of the others. Recall that we have ` = dn/ke layers and therefore after ` layers, all the vectors h(i)0 ’s are transformed to v\n(i)’s, which complete the proof sketch."}, {"heading": "4 POWER OF ALL-CONVOLUTIONAL RESIDUAL NETWORKS", "text": "Inspired by our theory, we experimented with all-convolutional residual networks on standard image classification benchmarks."}, {"heading": "4.1 CIFAR10 AND CIFAR100", "text": "Our architectures for CIFAR10 and CIFAR100 are identical except for the final dimension corresponding to the number of classes 10 and 100, respectively. In Table 1, we outline our architecture. Each residual block has the form x+C2(ReLU(C1x)), where C1, C2 are convolutions of the specified dimension (kernel width, kernel height, number of input channels, number of output channels). The second convolution in each block always has stride 1, while the first may have stride 2 where indicated. In cases where transformation is not dimensionality-preserving, the original input x is adjusted using averaging pooling and padding as is standard in residual layers.\nWe trained our models with the Tensorflow framework, using a momentum optimizer with momentum 0.9, and batch size is 128. All convolutional weights are trained with weight decay 0.0001. The initial learning rate is 0.05, which drops by a factor 10 and 30000 and 50000 steps. The model reaches peak performance at around 50k steps, which takes about 24h on a single NVIDIA Tesla K40 GPU. Our code can be easily derived from an open source implementation3 by removing batch normalization, adjusting the residual components and model architecture. An important departure from the code is that we initialize a residual convolutional layer of kernel size k × k and c output channels using a random normal initializer of standard deviation σ = 1/k2c, rather than 1/k √ c used for standard convolutional layers. This substantially smaller weight initialization helped training, while not affecting representation.\nA notable difference from standard models is that the last layer is not trained, but simply a fixed random projection. On the one hand, this slightly improved test error (perhaps due to a regularizing effect). On the other hand, it means that the only trainable weights in our model are those of the convolutions, making our architecture “all-convolutional”.\n3https://github.com/tensorflow/models/tree/master/resnet\nAn interesting aspect of our model is that despite its massive size of 13.59 million trainable parameters, the model does not seem to overfit too quickly even though the data set size is 50000. In contrast, we found it difficult to train a model with batch normalization of this size without significant overfitting on CIFAR10.\nTable 2 summarizes the top-1 classification error of our models compared with a non-exhaustive list of previous works, restricted to the best previous all-convolutional result by Springenberg et al. (2014), the first residual results He et al. (2015), and state-of-the-art results on CIFAR by Huang et al. (2016). All results are with standard data augmentation."}, {"heading": "4.2 IMAGENET", "text": "The ImageNet ILSVRC 2012 data set has 1, 281, 167 data points with 1000 classes. Each image is resized to 224 × 224 pixels with 3 channels. We experimented with an all-convolutional variant of the 34-layer network in He et al. (2015). The original model achieved 25.03% classification error. Our derived model has 35.7M trainable parameters. We trained the model with a momentum optimizer (with momentum 0.9) and a learning rate schedule that decays by a factor of 0.94 every two epochs, starting from the initial learning rate 0.1. Training was distributed across 6 machines\nupdating asynchronously. Each machine was equipped with 8 GPUs (NVIDIA Tesla K40) and used batch size 256 split across the 8 GPUs so that each GPU updated with batches of size 32.\nIn contrast to the situation with CIFAR10 and CIFAR100, on ImageNet our all-convolutional model performed significantly worse than its original counterpart. Specifically, we experienced a significant amount of underfitting suggesting that a larger model would likely perform better.\nDespite this issue, our model still reached 35.29% top-1 classification error on the test set (50000 data points), and 14.17% top-5 test error after 700, 000 steps (about one week of training). While no longer state-of-the-art, this performance is significantly better than the 40.7% reported by Krizhevsky et al. (2012), as well as the best all-convolutional architecture by Springenberg et al. (2014). We believe it is quite likely that a better learning rate schedule and hyperparameter settings of our model could substantially improve on the preliminary performance reported here."}, {"heading": "5 CONCLUSION", "text": "Our theory underlines the importance of identity parameterizations when training deep artificial neural networks. An outstanding open problem is to extend our optimization result to the non-linear case where each residual has a single ReLU activiation as in our expressivity result. We conjecture that a result analogous to Theorem 2.2 is true for the general non-linear case. Unlike with the standard parameterization, we see no fundamental obstacle for such a result.\nWe hope our theory and experiments together help simplify the state of deep learning by aiming to explain its success with a few fundamental principles, rather than a multitude of tricks that need to be delicately combined. We believe that much of the advances in image recognition can be achieved with residual convolutional layers and ReLU activations alone. This could lead to extremely simple (albeit deep) architectures that match the state-of-the-art on all image classification benchmarks."}, {"heading": "A MISSING PROOFS IN SECTION 2", "text": "In this section, we give the complete proofs for Theorem 2.1 and Lemma 2.4, which are omitted in Section 2.\nA.1 PROOF OF THEOREM 2.1\nIt turns out the proof will be significantly easier if R is assumed to be a symmetric positive semidefinite (PSD) matrix, or if we allow the variables to be complex matrices. Here we first give a proof sketch for the first special case. The readers can skip it and jumps to the full proof below. We will also prove stronger results, namely, |||A?||| ≤ 3γ/`, for the special case. When R is PSD, it can be diagonalized by orthonormal matrix U in the sense that R = UZU>, where Z = diag(z1, . . . , zd) is a diagonal matrix with non-negative diagonal entries z1, . . . , zd. Let A?1 = · · · = A?` = U diag(z 1/` i )U > − Id, then we have\n(Id +A?` ) · · · (Id +A?1) = (U diag(z 1/` i )U >)` = U diag(z 1/` i ) `U (since U>U = Id)\n= UZU> = R .\nWe see that the network defined by A? reconstruct the transformation R, and therefore it’s a global minimum of the population risk (formally see Claim 2.3 below). Next, we verify that each of the A?j has small spectral norm:\n‖A?j‖ = ‖Id− U diag(z 1/` i )U >)‖ = ‖U(Id− diag(zi)1/`)U>‖ = ‖Id− diag(zi)1/`‖ (since U is orthonormal)\n= max i |z1/`i − 1| . (A.1)\nSince σmin(R) ≤ zi ≤ σmax(R), we have ` ≥ 3γ ≥ | log zi|. It follows that\n|z1/`i − 1| = |e (log zi)/` − 1| ≤ 3|(log zi)/`| ≤ 3γ/` . (since |ex − 1| ≤ 3|x| for all |x| ≤ 1)\nThen using equation (A.1) and the equation above, we have that |||A||| ≤ maxj‖A?j‖ ≤ 3γ/`, which completes the proof for the special case.\nNext we give the formal full proof of Theorem 2.1.\nProof of Theorem 2.1. We assume the dimension d is an even number. The odd case has very similar proof and is left to the readers. LetR = UKV > be its singular value decomposition, where U ,V are two orthonormal matrices andK is a diagonal matrix. Since U is a normal matrix (that is, U satisfies thatUU> = U>U ), by Claim C.1, we have thatU can be block-diagnolaized by orthonormal matrix S into U = SDS−1, where D = diag(D1, . . . , Dd/2) is a real block diagonal matrix with each block Di being of size 2× 2. SinceU is orthonormal, U has all its eigenvalues lying on the unit circle (in complex plane). SinceD and U are unitarily similar to each other, D also has eigenvalues lying on the unit circle, and so does each of the block Di. This means that each Di is a 2× 2 dimensional rotation matrix. Each rotation matrix can be written as T (θ) = [ cos θ − sin θ sin θ cos θ ] . Suppose Di = T (θi) where θi ∈ [−π, π]. Then\nwe have that Di = T (θi/q)q for any integer q (that is chosen later). Let W = diag(T (θi/q)). Therefore, it follows that D = diag(Di) = W q. Moreover, we have U = SDS−1 = (SWS−1)q . Therefore, let B1 = B2 = · · · = Bq = Id − SWS−1, then we have U = (Id + Bq) . . . (Id + B1). We verify the spectral norm of these matrices are indeed small,\n‖Bj‖ = ∥∥Id− SWS−1∥∥ = ∥∥S(Id−W )S−1∥∥\n= ‖Id−W‖ (since S is unitary) = max i∈[d/2] ‖T (0)− T (θi/q)‖ (since W = diag(T (θi/q)) is block diagonal)\n= max | sin(θi/q)| ≤ π/q .\nSimilarly, we can choose B′1, . . . , B ′ q with ‖Cj‖ ≤ π/q so that V > = (Id +B′q) . . . (Id +B′1).\nLast, we deal with the diagonal matrix K. Let K = diag(ki). We have min ki = σmin(R),max ki = σmax(R). Then, we can write K = (K ′)p where K ′ = diag(k 1/p i ) and p is an integer to be chosen later. We have that ‖K ′ − Id‖ ≤ max |k1/pi − 1| ≤ max |elog ki·1/p − 1|. When p ≥ γ = max{log max ki,− log min ki} = max{log σmax(R),− log σmin(R)}, we have that\n‖K ′ − Id‖ ≤ max |elog ki·1/p − 1| ≤ 3 max | log ki · 1/p| = 3γ/p . (since |ex − 1| ≤ 3|x| for |x| ≤ 1)\nLet B′′1 = · · · = B′′p = K ′ − Id and then we have K = (Id + B′′p ) · · · (Id + B′′1 ). Finally, we choose p = ` √ 3γ\n2( √ π+ √ 3γ)\nand q = ` √ π√\nπ+ √ 3γ , 4and let A2p+q = Bq, · · · = Ap+q+1 = B1, Ap+q = B′′p , . . . , Aq+1 = B ′′ 1 , Aq = B ′ q, . . . , A1 = B ′ 1. We have that 2q + ` = 1 and\nR = UKV > = (Id +A`) . . . (Id +A1) .\nMoreover, we have |||A||| ≤ max{‖Bj‖, ‖B′j‖.‖B′′j ‖} ≤ π/q + 3γ/p ≤ 2( √ π + √ 3γ)2/`, as desired.\n4Here for notational convenience, p, q are not chosen to be integers. But rounding them to closest integer will change final bound of the norm by small constant factor.\nA.2 PROOF OF LEMMA 2.4\nWe compute the partial gradients by definition. Let ∆j ∈ Rd×d be an infinitesimal change to Aj . Using Claim 2.3, consider the Taylor expansion of f(A1, . . . , A` + ∆j , . . . , A`)\nf(A1, . . . , A` + ∆j , . . . , A`) = ∥∥∥((Id +A`) · · · (Id +Aj + ∆j) . . . (Id +A1)−R)Σ1/2∥∥∥2\nF = ∥∥∥((Id +A`) · · · (Id +A1)−R)Σ1/2 + (Id +A`) · · ·∆j . . . (Id +A1)Σ1/2∥∥∥2\nF = ∥∥∥(Id +A`) · · · (Id +A1)−R)Σ1/2∥∥∥2\nF +\n2〈((Id +A`) · · · (Id +A1)−R)Σ1/2, (Id +A`) · · ·∆j . . . (Id +A1)Σ1/2〉+O(‖∆j‖2F ) = f(A) + 2〈(Id +A>` ) . . . (Id +A>j+1)EΣ(Id +A>j−1) . . . (Id +A>1 ),∆j〉+O(‖∆j‖2F ) .\nBy definition, this means that the ∂f∂Aj = 2(Id + A > ` ) . . . (Id + A > j+1)EΣ(Id + A > j−1) . . . (Id + A>1 )."}, {"heading": "B MISSING PROOFS IN SECTION 3", "text": "In this section, we provide the full proof of Theorem 3.2. We start with the following Lemma that constructs a building block T that transform k vectors of an arbitrary sequence of n vectors to any arbitrary set of vectors, and main the value of the others. For better abstraction we use α(i),β(i) to denote the sequence of vectors.\nLemma B.1. Let S ⊂ [n] be of size k. Suppose α(1), . . . , α(n) is a sequences of n vectors satisfying a) for every 1 ≤ i ≤ n, we have 1−ρ′ ≤ ‖αi‖2 ≤ 1+ρ′, and b) if i 6= j and S contains at least one of i, j, then ‖α(i)−β(j)‖ ≥ 3ρ′. Let β(1), . . . , β(n) be an arbitrary sequence of vectors. Then, there exists U, V ∈ Rk×k, s such that for every i ∈ S, we have TU,V,s(α(i)) = β(i) − α(i), and moreover, for every i ∈ [n]\\S we have TU,V,s(α(i)) = 0.\nWe can see that the conclusion implies\nβ(i) = α(i) + TU,V,s(α(i)) ∀i ∈ S α(i) = α(i) + TU,V,s(α(i)) ∀i 6∈ S\nwhich is a different way of writing equation (3.6).\nProof of Lemma B.1. Without loss of generality, suppose S = {1, . . . , k}. We construct U, V, s as follows. Let the i-th row of U be α(i) for i ∈ [k], and let s = −(1− 2ρ′) · 1 where 1 denotes the all 1’s vector. Let the i-column of V be 1‖α(i)‖2−(1−2ρ′) (β (i) − α(i)) for i ∈ [k].\nNext we verify that the correctness of the construction. We first consider 1 ≤ i ≤ k. We have that Uα(i) is a a vector with i-th coordinate equal to ‖α(i)‖2 ≥ 1 − ρ′. The j-th coordinate of Uα(i) is equal to 〈α(j), α(i)〉, which can be upperbounded using the assumption of the Lemma by\n〈α(j), α(i)〉 = 1 2\n( ‖α(i)‖2 + ‖α(j)‖2 ) − ‖α(i) − α(j)‖2 ≤ 1 + ρ′ − 3ρ′ ≤ 1− 2ρ′ . (B.1)\nTherefore, this means Uα(i) − (1 − 2ρ′) · 1contains a single positive entry (with value at least ‖α(i)‖2 − (1 − 2ρ′) ≥ ρ′), and all other entries being non-positive. This means that ReLu(Uα(i) +b) = ( ‖α(i)‖2 − (1− 2ρ′) ) ei where ei is the i-th natural basis vector. It follows that V ReLu(Uα(i) + b) = (‖α(i)‖2 − (1− 2ρ′))V ei = β(i) − α(i).\nFinally, consider n ≥ i > k. Then similarly to the computation in equation (B.1), Uα(i) is a vector with all coordinates less than 1− 2ρ′. Therefore Uα(i) + b is a vector with negative entries. Hence we have ReLu(Uα(i) + b) = 0, which implies V ReLu(Uα(i) + b) = 0.\nNow we are ready to state the formal version of Lemma 3.3.\nLemma B.2. Suppose a sequence of n vectors z(1), . . . , z(n) satisfies a relaxed version of Assumption 3.1: a) for every i, 1− ρ′ ≤ ‖z(i)‖2 ≤ 1 + ρ′ b) for every i 6= j, we have ‖z(i) − z(j)‖2 ≥ ρ′;. Let v(1), . . . , v(n) be defined above. Then there exists weigh matrices (A1, B1), . . . , (A`, B`), such that given ∀i, h(i)0 = z(i), we have,\n∀i ∈ {1, . . . , n}, h(i)` = v (i) .\nWe will use Lemma B.1 repeatedly to construct building blocks TAj ,Bk,sj (·), and thus prove Lemma B.2. Each building block TAj ,Bk,sj (·) takes a subset of k vectors among {z(1), . . . , z(n)} and convert them to v(i)’s, while maintaining all other vectors as fixed. Since they are totally n/k layers, we finally maps all the z(i)’s to the target vectors v(i)’s.\nProof of Lemma B.2. We use Lemma B.1 repeatedly. Let S1 = [1, . . . , k]. Then using Lemma B.1 with α(i) = z(i) and β(i) = v(i) for i ∈ [n], we obtain that there exists A1, B1, b1 such that for i ≤ k, it holds that h(i)1 = z(i) + TA1,B1,b1(z(i)) = v(i), and for i ≥ k, it holds that h (i) 1 = z(i) + TA1,B1,b1(z(i)) = z(i). Now we construct the other layers inductively. We will construct the layers such that the hidden variable at layer j satisfies h(i)j = v\n(i) for every 1 ≤ i ≤ jk, and h(i)j = z(i) for every n ≥ i > jk. Assume that we have constructed the first j layer and next we use Lemma B.1 to construct the j + 1 layer. Then we argue that the choice of α(1) = v(1), . . . , α(jk) = v(jk), α(jk+1) = z(jk+1), . . . , α(n) = z(n), and S = {jk + 1, . . . , (j + 1)k} satisfies the assumption of Lemma B.1. Indeed, because qi’s are chosen uniformly randomly, we have w.h.p for every s and i, 〈qs, z(i)〉 ≤ 1− ρ′. Thus, since v(i) ∈ {q1, . . . , qr}, we have that v(i) also doesn’t correlate with any of the z(i). Then we apply Lemma B.1 and conclude that there exists Aj+1 = U,Bj+1 = V, bj+1 = s such that TAj+1,bj+1,bj+1(v(i)) = 0 for i ≤ jk, TAj+1,bj+1,bj+1(z(i)) = v(i)− z(i) for jk < i ≤ (j + 1)k, and TAj+1,bj+1,bj+1(z(i)) = 0 for n ≥ i > (j + 1)k. These imply that\nh (i) j+1 = h (i) j + TAj+1,bj+1,bj+1(v (i)) = v(i) ∀1 ≤ i ≤ jk\nh (i) j+1 = h (i) j + TAj+1,bj+1,bj+1(z (i)) = v(i) ∀jk + 1 ≤ i ≤ (j + 1)k\nh (i) j+1 = h (i) j + TAj+1,bj+1,bj+1(z (i)) = z(i) ∀(j + 1)k < i ≤ n Therefore we constructed the j + 1 layers that meets the inductive hypothesis for layer j + 1. Therefore, by induction we get all the layers, and the last layer satisfies that h(i)` = v\n(i) for every example i.\nNow we ready to prove Theorem 3.2, following the general plan sketched in Section 3.\nProof of Theorem 3.2. We use formalize the intuition discussed below Theorem 3.2. First, take k = c(log n)/ρ2 for sufficiently large absolute constant c (for example, c = 10 works), by JohnsonLindenstrauss Theorem (Johnson & Lindenstrauss (1984), or see Wikipedia (2016)) we have that when A0 is a random matrix with standard normal entires, with high probability, all the pairwise distance between the the set of vectors {0, x(1), . . . , x(n)} are preserved up to 1 ± ρ/3 factor. That is, we have that for every i, 1−ρ/3 ≤ ‖A0x(i)‖ ≤ 1+ρ/3, and for every i 6= j, ‖A0x(i)−A0x(j)‖ ≥ ρ(1 − ρ/3) ≥ 2ρ/3. Let z(i) = A0x(i) and ρ′ = ρ/3. Then we have z(i)’s satisfy the condition of Lemam B.2. We pick r random vectors q1, . . . , qr in Rk. Let v(1), . . . , v(n) be defined as in equation (3.2). Then by Lemma B.2, we can construct matrices (A1, B1), . . . , (A`, B`) such that\nh (i) ` = v (i) . (B.2)\nNote that v(i) ∈ {q1, . . . , qr}, and qi’s are random unit vector. Therefore, the choice of α(1) = q1, . . . , α\n(r) = qr, β(1) = e1, . . . , β(r) = er, and satisfies the condition of Lemma B.1, and using Lemma B.1 we conclude that there exists A`+1, B`+1, s`+1 such that\nej = vj + TA`+1,B`+1,b`+1(vj), for every j ∈ {1, . . . , r} .. (B.3)\nBy the definition of v(i) in equation (3.2) and equation (B.2), we conclude that ŷ(i) = h(i)` + TA`+1,B`+1,b`+1(h (i) ` ) = y (i)., which complete the proof."}, {"heading": "C TOOLBOX", "text": "In this section, we state two folklore linear algebra statements. The following Claim should be known, but we can’t find it in the literature. We provide the proof here for completeness. Claim C.1. Let U ∈ Rd×d be a real normal matrix (that is, it satisfies UU> = U>U ). Then, there exists an orthonormal matrix S ∈ Rd×d such that\nU = SDS> ,\nwhere D is a real block diagonal matrix that consists of blocks with size at most 2× 2. Moreover, if d is even, then D consists of blocks with size exactly 2× 2.\nProof. Since U is a normal matrix, it is unitarily diagonalizable (see Weisstein (2016) for backgrounds). Therefore, there exists unitary matrix V in Cd×d and diagonal matrix in Cd×d such that U has eigen-decomposition U = V ΛV ∗. Since U itself is a real matrix, we have that the eigenvalues (the diagonal entries of Λ) come as conjugate pairs, and so do the eigenvectors (which are the columns of V ). That is, we can group the columns of V into pairs (v1, v̄1), . . . , (vs, v̄s), vs+1, . . . , vt, and let the corresponding eigenvalues be λ1, λ̄1, . . . , λλs , λ̄s, λs+1, . . . , λt. Here λs+1, . . . , λt ∈ R. Then we get that U =∑s i=1 2<(viλiv∗i ) + ∑t i=s+1 viλiv > i . Let Qi = <(viλiv∗i ), then we have that Qi is a real matrix of rank-2. Let Si ∈ Rd×2 be a orthonormal basis of the column span ofQi and then we have thatQi can be written as Qi = SiDiS>i where Di is a 2× 2 matrix. Finally, let S = [S1, . . . , Ss, vs+1, . . . , vt], and D = diag(D1, . . . , Ds, λs+1, . . . , λt) we complete the proof.\nThe following Claim is used in the proof of Theorem 2.2. We provide a proof here for completeness. Claim C.2 (folklore). For any two matrices A,B ∈ Rd×d, we have that\n‖AB‖F ≥ σmin(A)‖B‖F .\nProof. Since σmin(A)2 is the smallest eigenvalue of A>A, we have that\nB>A>AB B> · σmin(A)2Id ·B .\nTherefore, it follows that\n‖AB‖2F = tr(B>A>AB) ≥ tr(B> · σmin(A)2Id ·B) = σmin(A) 2tr(B>B) = σmin(A)2‖B‖2F .\nTaking square root of both sides completes the proof."}], "references": [{"title": "Random matrices and complexity of spin glasses", "author": ["Antonio Auffinger", "Gérard Ben Arous", "Jiřı́ Černỳ"], "venue": "Communications on Pure and Applied Mathematics,", "citeRegEx": "Auffinger et al\\.,? \\Q2013\\E", "shortCiteRegEx": "Auffinger et al\\.", "year": 2013}, {"title": "Neural networks and principal component analysis: Learning from examples without local minima", "author": ["P. Baldi", "K. Hornik"], "venue": "Neural Netw.,", "citeRegEx": "Baldi and Hornik.,? \\Q1989\\E", "shortCiteRegEx": "Baldi and Hornik.", "year": 1989}, {"title": "The loss surfaces of multilayer networks", "author": ["Anna Choromanska", "Mikael Henaff", "Michael Mathieu", "Gérard Ben Arous", "Yann LeCun"], "venue": "In AISTATS,", "citeRegEx": "Choromanska et al\\.,? \\Q2015\\E", "shortCiteRegEx": "Choromanska et al\\.", "year": 2015}, {"title": "Identifying and attacking the saddle point problem in high-dimensional non-convex optimization", "author": ["Yann N Dauphin", "Razvan Pascanu", "Caglar Gulcehre", "Kyunghyun Cho", "Surya Ganguli", "Yoshua Bengio"], "venue": "In Advances in neural information processing systems,", "citeRegEx": "Dauphin et al\\.,? \\Q2014\\E", "shortCiteRegEx": "Dauphin et al\\.", "year": 2014}, {"title": "Qualitatively characterizing neural network optimization problems", "author": ["I.J. Goodfellow", "O. Vinyals", "A.M. Saxe"], "venue": "ArXiv e-prints,", "citeRegEx": "Goodfellow et al\\.,? \\Q2014\\E", "shortCiteRegEx": "Goodfellow et al\\.", "year": 2014}, {"title": "Deep residual learning for image recognition", "author": ["Kaiming He", "Xiangyu Zhang", "Shaoqing Ren", "Jian Sun"], "venue": "In arXiv prepring arXiv:1506.01497,", "citeRegEx": "He et al\\.,? \\Q2015\\E", "shortCiteRegEx": "He et al\\.", "year": 2015}, {"title": "Identity mappings in deep residual networks", "author": ["Kaiming He", "Xiangyu Zhang", "Shaoqing Ren", "Jian Sun"], "venue": "In Computer Vision - ECCV 2016 - 14th European Conference,", "citeRegEx": "He et al\\.,? \\Q2016\\E", "shortCiteRegEx": "He et al\\.", "year": 2016}, {"title": "Densely connected convolutional networks", "author": ["Gao Huang", "Zhuang Liu", "Kilian Q. Weinberger"], "venue": "CoRR, abs/1608.06993,", "citeRegEx": "38", "shortCiteRegEx": "38", "year": 2016}, {"title": "Batch normalization: Accelerating deep network training by reducing internal covariate shift", "author": ["Sergey Ioffe", "Christian Szegedy"], "venue": "In Proceedings of the 32nd International Conference on Machine Learning, ICML 2015,", "citeRegEx": "Ioffe and Szegedy.,? \\Q2015\\E", "shortCiteRegEx": "Ioffe and Szegedy.", "year": 2015}, {"title": "Extensions of lipschitz mappings into a hilbert space", "author": ["William B Johnson", "Joram Lindenstrauss"], "venue": "Contemporary mathematics,", "citeRegEx": "Johnson and Lindenstrauss.,? \\Q1984\\E", "shortCiteRegEx": "Johnson and Lindenstrauss.", "year": 1984}, {"title": "Linear Convergence of Gradient and Proximal-Gradient Methods Under the Polyak-\\L{}ojasiewicz Condition", "author": ["H. Karimi", "J. Nutini", "M. Schmidt"], "venue": null, "citeRegEx": "Karimi et al\\.,? \\Q2016\\E", "shortCiteRegEx": "Karimi et al\\.", "year": 2016}, {"title": "Deep Learning without Poor Local Minima", "author": ["K. Kawaguchi"], "venue": "ArXiv e-prints,", "citeRegEx": "Kawaguchi.,? \\Q2016\\E", "shortCiteRegEx": "Kawaguchi.", "year": 2016}, {"title": "Imagenet classification with deep convolutional neural networks. In Advances in neural information processing", "author": ["Alex Krizhevsky", "Ilya Sutskever", "Geoffrey E Hinton"], "venue": null, "citeRegEx": "Krizhevsky et al\\.,? \\Q2012\\E", "shortCiteRegEx": "Krizhevsky et al\\.", "year": 2012}, {"title": "No bad local minima: Data independent training error guarantees for multilayer neural networks", "author": ["D. Soudry", "Y. Carmon"], "venue": null, "citeRegEx": "Soudry and Carmon.,? \\Q2016\\E", "shortCiteRegEx": "Soudry and Carmon.", "year": 2016}, {"title": "Striving for Simplicity: The All Convolutional Net", "author": ["J.T. Springenberg", "A. Dosovitskiy", "T. Brox", "M. Riedmiller"], "venue": "ArXiv e-prints,", "citeRegEx": "Springenberg et al\\.,? \\Q2014\\E", "shortCiteRegEx": "Springenberg et al\\.", "year": 2014}, {"title": "Normal matrix, from mathworld–a wolfram web resource., 2016", "author": ["Eric W. Weisstein"], "venue": "URL http: //mathworld.wolfram.com/NormalMatrix.html", "citeRegEx": "Weisstein.,? \\Q2016\\E", "shortCiteRegEx": "Weisstein.", "year": 2016}], "referenceMentions": [{"referenceID": 10, "context": "Traditional convolutional neural networks for image classification, such as AlexNet (Krizhevsky et al. (2012)), are parameterized in such a way that when all trainable weights are 0, a convolutional layer represents the 0-mapping.", "startOffset": 85, "endOffset": 110}, {"referenceID": 10, "context": "Traditional convolutional neural networks for image classification, such as AlexNet (Krizhevsky et al. (2012)), are parameterized in such a way that when all trainable weights are 0, a convolutional layer represents the 0-mapping. Moreover, the weights are initialized symmetrically around 0. This standard parameterization makes it non-trivial for a convolutional layer trained with stochastic gradient methods to preserve features that were already good. Put differently, such convolutional layers cannot easily converge to the identity transformation at training time. This shortcoming was observed and partially addressed by Ioffe & Szegedy (2015) through batch normalization, i.", "startOffset": 85, "endOffset": 652}, {"referenceID": 5, "context": "But the idea remained somewhat implicit until residual networks (He et al. (2015); He et al.", "startOffset": 65, "endOffset": 82}, {"referenceID": 5, "context": "But the idea remained somewhat implicit until residual networks (He et al. (2015); He et al. (2016)) explicitly introduced a reparameterization of the convolutional layers such that when all trainable weights are 0, the layer represents the identity function.", "startOffset": 65, "endOffset": 100}, {"referenceID": 11, "context": "In contrast, for standard linear neural networks we only know, by work of Kawaguchi (2016) that these networks don’t have local optima except the global optimum, but it doesn’t rule out other critical points.", "startOffset": 74, "endOffset": 91}, {"referenceID": 5, "context": "residual network reported in He et al. (2015), which achieved 6.", "startOffset": 29, "endOffset": 46}, {"referenceID": 5, "context": "residual network reported in He et al. (2015), which achieved 6.43%. Moreover, it improves upon the performance of the previous best all-convolutional network, 7.25%, achieved by Springenberg et al. (2014). Unlike ours, this previous all-convolutional architecture additionally required dropout and a non-standard preprocessing (ZCA) of the entire data set.", "startOffset": 29, "endOffset": 206}, {"referenceID": 5, "context": "residual network reported in He et al. (2015), which achieved 6.43%. Moreover, it improves upon the performance of the previous best all-convolutional network, 7.25%, achieved by Springenberg et al. (2014). Unlike ours, this previous all-convolutional architecture additionally required dropout and a non-standard preprocessing (ZCA) of the entire data set. Our architecture also improves significantly upon Springenberg et al. (2014) on both Cifar100 and ImageNet.", "startOffset": 29, "endOffset": 435}, {"referenceID": 1, "context": "Since the advent of residual networks (He et al. (2015); He et al.", "startOffset": 39, "endOffset": 56}, {"referenceID": 1, "context": "Since the advent of residual networks (He et al. (2015); He et al. (2016)), most state-of-the-art networks for image classification have adopted a residual parameterization of the convolutional layers.", "startOffset": 39, "endOffset": 74}, {"referenceID": 1, "context": "Since the advent of residual networks (He et al. (2015); He et al. (2016)), most state-of-the-art networks for image classification have adopted a residual parameterization of the convolutional layers. Further impressive improvements were reported by Huang et al. (2016) with a variant of residual networks, called dense nets.", "startOffset": 39, "endOffset": 271}, {"referenceID": 1, "context": "(2014) and Dauphin et al. (2014) suggest that the training objectives have a limited number of bad local minima with large function values.", "startOffset": 11, "endOffset": 33}, {"referenceID": 1, "context": "Work by Choromanska et al. (2015) draws an analogy between the optimization landscape of neural nets and that of the spin glass model in physics (Auffinger et al.", "startOffset": 8, "endOffset": 34}, {"referenceID": 0, "context": "(2015) draws an analogy between the optimization landscape of neural nets and that of the spin glass model in physics (Auffinger et al. (2013)).", "startOffset": 119, "endOffset": 143}, {"referenceID": 0, "context": "(2015) draws an analogy between the optimization landscape of neural nets and that of the spin glass model in physics (Auffinger et al. (2013)). Soudry & Carmon (2016) showed that 2-layer neural networks have no bad differentiable local minima, but they didn’t prove that a good differentiable local minimum does exist.", "startOffset": 119, "endOffset": 168}, {"referenceID": 0, "context": "(2015) draws an analogy between the optimization landscape of neural nets and that of the spin glass model in physics (Auffinger et al. (2013)). Soudry & Carmon (2016) showed that 2-layer neural networks have no bad differentiable local minima, but they didn’t prove that a good differentiable local minimum does exist. Baldi & Hornik (1989) and Kawaguchi (2016) show that linear neural networks have no bad local minima.", "startOffset": 119, "endOffset": 342}, {"referenceID": 0, "context": "(2015) draws an analogy between the optimization landscape of neural nets and that of the spin glass model in physics (Auffinger et al. (2013)). Soudry & Carmon (2016) showed that 2-layer neural networks have no bad differentiable local minima, but they didn’t prove that a good differentiable local minimum does exist. Baldi & Hornik (1989) and Kawaguchi (2016) show that linear neural networks have no bad local minima.", "startOffset": 119, "endOffset": 363}, {"referenceID": 10, "context": "3) says that the gradient has fairly large norm compared to the error, which guarantees convergence of the gradient descent to a global minimum (Karimi et al. (2016)) if the iterates stay inside the domain Bτ , which is not guaranteed by Theorem 2.", "startOffset": 145, "endOffset": 166}, {"referenceID": 5, "context": "In comparison with the full pre-activation architecture in He et al. (2016), we remove two batch normalization layers and one ReLU layer in each building block.", "startOffset": 59, "endOffset": 76}, {"referenceID": 12, "context": "Table 2 summarizes the top-1 classification error of our models compared with a non-exhaustive list of previous works, restricted to the best previous all-convolutional result by Springenberg et al. (2014), the first residual results He et al.", "startOffset": 179, "endOffset": 206}, {"referenceID": 5, "context": "(2014), the first residual results He et al. (2015), and state-of-the-art results on CIFAR by Huang et al.", "startOffset": 35, "endOffset": 52}, {"referenceID": 5, "context": "(2014), the first residual results He et al. (2015), and state-of-the-art results on CIFAR by Huang et al. (2016). All results are with standard data augmentation.", "startOffset": 35, "endOffset": 114}, {"referenceID": 5, "context": "We experimented with an all-convolutional variant of the 34-layer network in He et al. (2015). The original model achieved 25.", "startOffset": 77, "endOffset": 94}, {"referenceID": 12, "context": "7% reported by Krizhevsky et al. (2012), as well as the best all-convolutional architecture by Springenberg et al.", "startOffset": 15, "endOffset": 40}, {"referenceID": 12, "context": "7% reported by Krizhevsky et al. (2012), as well as the best all-convolutional architecture by Springenberg et al. (2014). We believe it is quite likely that a better learning rate schedule and hyperparameter settings of our model could substantially improve on the preliminary performance reported here.", "startOffset": 15, "endOffset": 122}], "year": 2016, "abstractText": "An emerging design principle in deep learning is that each layer of a deep artificial neural network should be able to easily express the identity transformation. This idea not only motivated various normalization techniques, such as batch normalization, but was also key to the immense success of residual networks. In this work, we put the principle of identity parameterization on a more solid theoretical footing alongside further empirical progress. We first give a strikingly simple proof that arbitrarily deep linear residual networks have no spurious local optima. The same result for feed-forward networks in their standard parameterization is substantially more delicate. Second, we show that residual networks with ReLu activations have universal finite-sample expressivity in the sense that the network can represent any function of its sample provided that the model has more parameters than the sample size. Directly inspired by our theory, we experiment with a radically simple residual architecture consisting of only residual convolutional layers and ReLu activations, but no batch normalization, dropout, or max pool. Our model improves significantly on previous all-convolutional networks on the CIFAR10, CIFAR100, and ImageNet classification benchmarks.", "creator": "TeX"}, "id": "ICLR_2017_163"}