{"name": "ICLR_2017_17.pdf", "metadata": {"source": "CRF", "title": null, "authors": ["C. Daniel Freeman", "Joan Bruna"], "emails": ["daniel.freeman@berkeley.edu", "bruna@cims.nyu.edu"], "sections": [{"heading": "1 INTRODUCTION", "text": "Optimization is a critical component in deep learning, governing its success in different areas of computer vision, speech processing and natural language processing. The prevalent optimization strategy is Stochastic Gradient Descent, invented by Robbins and Munro in the 50s. The empirical performance of SGD on these models is better than one could expect in generic, arbitrary non-convex loss surfaces, often aided by modifications yielding significant speedups Duchi et al. (2011); Hinton et al. (2012); Ioffe & Szegedy (2015); Kingma & Ba (2014). This raises a number of theoretical questions as to why neural network optimization does not suffer in practice from poor local minima.\nThe loss surface of deep neural networks has recently attracted interest in the optimization and machine learning communities as a paradigmatic example of a hard, high-dimensional, non-convex problem. Recent work has explored models from statistical physics such as spin glasses Choromanska et al. (2015), in order to understand the macroscopic properties of the system, but at the expense of strongly simplifying the nonlinear nature of the model. Other authors have advocated that the real danger in high-dimensional setups are saddle points rather than poor local minima Dauphin et al. (2014), although recent results rigorously establish that gradient descent does not get stuck on saddle points Lee et al. (2016) but merely slowed down. Other notable recent contributions are Kawaguchi (2016), which further develops the spin-glass connection from Choromanska et al. (2015) and resolves the linear case by showing that no poor local minima exist; Sagun et al. (2014) which also\n∗Currently on leave from UC Berkeley.\ndiscusses the impact of stochastic vs plain gradient, Soudry & Carmon (2016), that studies Empirical Risk Minimization for piecewise multilayer neural networks under overparametrization (which needs to grow with the amount of available data), and Goodfellow et al. (2014), which provided insightful intuitions on the loss surface of large deep learning models and partly motivated our work. Additionally, the work Safran & Shamir (2015) studies some topological properties of homogeneous nonlinear networks and shows how overparametrization acts upon these properties, and the pioneering Shamir (2016) studied the distribution-specific hardness of optimizing non-convex objectives. Lastly, several papers submitted concurrently and independently of this one deserve note, particularly Swirszcz et al. (2016) which analyzes the explicit criteria under which sigmoid-based neural networks become trapped by poor local minima, as well as Tian (2017), which offers a complementary study of two layer ReLU based networks, and their learning dynamics.\nIn this work, we do not make any linearity assumption and study conditions on the data distribution and model architecture that prevent the existence of bad local minima. The loss surface F (θ) of a given model can be expressed in terms of its level sets Ωλ, which contain for each energy level λ all parameters θ yielding a loss smaller or equal than λ. A first question we address concerns the topology of these level sets, i.e. under which conditions they are connected. Connected level sets imply that one can always find a descent direction at each energy level, and therefore that no poor local minima can exist. In absence of nonlinearities, deep (linear) networks have connected level sets Kawaguchi (2016). We first generalize this result to include ridge regression (in the two layer case) and provide an alternative, more direct proof of the general case. We then move to the half-rectified case and show that the topology is intrinsically different and clearly dependent on the interplay between data distribution and model architecture. Our main theoretical contribution is to prove that half-rectified single layer networks are asymptotically connected, and we provide explicit bounds that reveal the aforementioned interplay.\nBeyond the question of whether the loss contains poor local minima or not, the immediate follow-up question that determines the convergence of algorithms in practice is the local conditioning of the loss surface. It is thus related not to the topology but to the shape or geometry of the level sets. As the energy level decays, one expects the level sets to exhibit more complex irregular structures, which correspond to regions where F (θ) has small curvature. In order to verify this intuition, we introduce an efficient algorithm to estimate the geometric regularity of these level sets by approximating geodesics of each level set starting at two random boundary points. Our algorithm uses dynamic programming and can be efficiently deployed to study mid-scale CNN architectures on MNIST, CIFAR-10 and RNN models on Penn Treebank next word prediction. Our empirical results show that these models have a nearly convex behavior up until their lowest test errors, with a single connected component that becomes more elongated as the energy decays. The rest of the paper is structured as follows. Section 2 presents our theoretical results on the topological connectedness of multilayer networks. Section 3 presents our path discovery algorithm and Section 4 covers the numerical experiments."}, {"heading": "2 TOPOLOGY OF LEVEL SETS", "text": "Let P be a probability measure on a product space X ×Y , where we assume X and Y are Euclidean vector spaces for simplicity. Let {(xi, yi)}i be an iid sample of size L drawn from P defining the training set. We consider the classic empirical risk minimization of the form\nFe(θ) = 1\nL L∑ l=1 ‖Φ(xi; θ)− yi‖2 + κR(θ) , (1)\nwhere Φ(x; θ) encapsulates the feature representation that uses parameters θ ∈ RS and R(θ) is a regularization term. In a deep neural network, θ contains the weights and biases used in all layers. For convenience, in our analysis we will also use the oracle risk minimization:\nFo(θ) = E(X,Y )∼P ‖Φ(X; θ)− Y ‖2 + κR(θ) . (2)\nOur setup considers the case whereR consists on either `1 or `2 norms, as we shall describe below. They correspond to well-known sparse and ridge regularization respectively."}, {"heading": "2.1 POOR LOCAL MINIMA CHARACTERIZATION FROM TOPOLOGICAL CONNECTEDNESS", "text": "We define the level set of F (θ) as\nΩF (λ) = {θ ∈ RS ; F (θ) ≤ λ} . (3)\nThe first question we study is the structure of critical points of Fe(θ) and Fo(θ) when Φ is a multilayer neural network. For simplicity, we consider first a strict notion of local minima: θ ∈ RS is a strict local minima of F if there is > 0 with F (θ′) > F (θ) for all θ′ ∈ B(θ, ) and θ′ 6= θ. In particular, we are interested to know whether Fe has local minima which are not global minima. This question is answered by knowing whether ΩF (λ) is connected at each energy level λ: Proposition 2.1. If ΩF (λ) is connected for all λ then every local minima of F (θ) is a global minima.\nStrict local minima implies that ∇F (θ) = 0 and HF (θ) 0, but avoids degenerate cases where F is constant along a manifold intersecting θ. In that scenario, if Uθ denotes that manifold, our reasoning immediately implies that if ΩF (λ) are connected, then for all > 0 there exists θ′ with dist(θ′,Uθ) ≤ and F (θ′) < F (θ). In other words, some element at the boundary of Uθ must be a saddle point. A stronger property that eliminates the risk of gradient descent getting stuck at Uθ is that all elements at the boundary of Uθ are saddle points. This can be guaranteed if one can show that there exists a path connecting any θ to the lowest energy level such that F is strictly decreasing along it.\nSuch degenerate cases arise in deep linear networks in absence of regularization. If θ = (W1, . . . ,WK) denotes any parameter value, with N1, . . . NK denoting the hidden layer sizes, and Fk ∈ GL+Nk(R) are arbitrary elements of the general linear group of invertible Nk × Nk matrices with positive determinant, then\nUθ = {W1F−11 , F1W2F −1 2 , . . . , FKWK ; Fk ∈ GL + Nk (R)} .\nIn particular, Uθ has a Lie Group structure. In the half-rectified nonlinear case, the general linear group is replaced by the Lie group of homogeneous invertible matrices Fk = diag(α1, . . . , αNk) with αj > 0.\nThis proposition shows that a sufficient condition to prevent the existence of poor local minima is having connected level sets, but this condition is not necessary: one can have isolated local minima lying at the same energy level. This can be the case in systems that are defined up to a discrete symmetry group, such as multilayer neural networks. However, as we shall see next, this case puts the system in a brittle position, since one needs to be able to account for all the local minima (and there can be exponentially many of them as the parameter dimensionality increases) and verify that their energy is indeed equal."}, {"heading": "2.2 THE LINEAR CASE", "text": "We first consider the particularly simple case where F is a multilayer network defined by\nΦ(x; θ) = WK . . .W1x , θ = (W1, . . . ,WK) . (4)\nand the ridge regression R(θ) = ‖θ‖2. This model defines a non-convex (and non-concave) loss Fe(θ). When κ = 0, it has been shown in Saxe et al. (2013) and Kawaguchi (2016) that in this case, every local minima is a global minima. We provide here an alternative proof of that result that uses a somewhat simpler argument and allows for κ > 0 in the case K = 2. Proposition 2.2. Let W1,W2, . . . ,WK be weight matrices of sizes nk × nk+1, k < K, and let Fe(θ), Fo(θ) denote the risk minimizations using Φ as in (4). Assume that nj ≥ min(n1, nK) for j = 2 . . .K − 1. Then ΩFe(λ) (and ΩFo ) is connected for all λ and all K when κ = 0, and for κ > 0 when K = 2; and therefore there are no poor local minima in these cases. Moreover, any θ can be connected to the lowest energy level with a strictly decreasing path.\nLet us highlight that this result is slightly complementary than that of Kawaguchi (2016), Theorem 2.3. Whereas we require nj ≥ min(n1, nK) for j = 2 . . .K − 1 and our analysis does not inform about the order of the saddle points, we do not need full rank assumptions on ΣX nor the weights Wk.\nThis result does also highlight a certain mismatch between the picture of having no poor local minima and generalization error. Incorporating regularization drastically changes the topology, and the fact that we are able to show connectedness only in the two-layer case with ridge regression is profound; we conjecture that extending it to deeper models requires a different regularization, perhaps using more general atomic norms Bach (2013). But we now move our interest to the nonlinear case, which is more relevant to our purposes."}, {"heading": "2.3 HALF-RECTIFIED NONLINEAR CASE", "text": "We now study the setting given by\nΦ(x; θ) = WKρWK−1ρ . . . ρW1x , θ = (W1, . . . ,WK) , (5)\nwhere ρ(z) = max(0, z). The biases can be implemented by replacing the input vector x with x = (x, 1) and by rebranding each parameter matrix as\nW i = ( Wi bi 0 1 ) ,\nwhere bi contains the biases for each layer. For simplicity, we continue to use Wi and x in the following."}, {"heading": "2.3.1 NONLINEAR MODELS ARE GENERALLY DISCONNECTED", "text": "One may wonder whether the same phenomena of global connectedness also holds in the halfrectified case. A simple motivating counterexample shows that this is not the case in general. Consider a simple setup with X ∈ R2 drawn from a mixture of two Gaussians N−1 and N1, and let Y = (X − µZ) · Z , where Z is the (hidden) mixture component taking {1,−1} values. Let Ŷ = Φ(X; {W1,W2}) be a single-hidden layer ReLU network, with two hidden units. Let θA be a configuration that bisects the two mixture components, and let θB the same configuration, but swapping the bisectrices. One can verify that they can both achieve arbitrarily small risk by letting the covariance of the mixture components go to 0. However, any path that connects θA to θB must necessarily pass through a point in which W1 has rank 1, which leads to an estimator with risk at least 1/2.\nIn fact, it is easy to see that this counter-example can be extended to any generic half-rectified architecture, if one is allowed to adversarially design a data distribution. For any given Φ(X; θ) with arbitrary architecture and current parameters θ = (Wi), let Pθ = {A1, . . . ,AS} be the underlying tessellation of the input space given by our current choice of parameters; that is, Φ(X; θ) is piece-wise linear and Pθ contains those pieces. Now let X be any arbitrary distribution with density p(x) > 0 for all x ∈ Rn, for example a Gaussian, and let Y | X d= Φ(X; θ) . Since Φ is invariant under a subgroup of permutations θσ of its hidden layers, it is easy to see that one can find two parameter values θA = θ and θB = θσ such that Fo(θA) = Fo(θB) = 0, but any continuous path γ(t) from θA to θB will have a different tessellation and therefore won’t satisfy Fo(γ(t)) = 0. Moreover, one can build on this counter-example to show that not only the level sets are disconnected, but also that there exist poor local minima. Let θ′ be a different set of parameters, and Y ′ | X d= Φ(X; θ′) be a different target distribution. Now consider the data distribution given by the mixture\nX | p(x) , z ∼ Bernoulli(π) , Y | X, z d= zΦ(X; θ) + (1− z)Φ(X; θ′) . By adjusting the mixture component π we can clearly change the risk at θ and θ′ and make them different, but we conjecture that this preserves the status of local minima of θ and θ′. Appendix E constructs a counter-example numerically.\nThis illustrates an intrinsic difficulty in the optimization landscape if one is after universal guarantees that do not depend upon the data distribution. This difficulty is non-existent in the linear case and not easy to exploit in mean-field approaches such as Choromanska et al. (2015), and shows that in general we should not expect to obtain connected level sets. However, connectedness can be recovered if one is willing to accept a small increase of energy and make some assumptions on the complexity of the regression task. Our main result shows that the amount by which the energy is allowed to increase is upper bounded by a quantity that trades-off model overparametrization and smoothness in the data distribution.\nFor that purpose, we start with a characterization of the oracle loss, and for simplicity let us assume Y ∈ R and let us first consider the case with a single hidden layer and `1 regularization: R(θ) = ‖θ‖1."}, {"heading": "2.3.2 PRELIMINARIES", "text": "Before proving our main result, we need to introduce preliminary notation and results. We first describe the case with a single hidden layer of size m.\nWe define\ne(m) = min W1∈Rm×n,‖W1(i)‖2≤1,W2∈Rm\nE{|Φ(X; θ)− Y |2}+ κ‖W2‖1 . (6)\nto be the oracle risk using m hidden units with norm ≤ 1 and using sparse regression. It is a well known result by Hornik and Cybenko that a single hidden layer is a universal approximator under very mild assumptions, i.e. limm→∞ e(m) = 0. This result merely states that our statistical setup is consistent, and it should not be surprising to the reader familiar with classic approximation theory. A more interesting question is the rate at which e(m) decays, which depends on the smoothness of the joint density (X,Y ) ∼ P relative to the nonlinear activation family we have chosen. For convenience, we redefine W = W1 and β = W2 and Z(W ) = max(0,WX). We also write z(w) = max(0, 〈w,X〉) where (X,Y ) ∼ P and w ∈ RN is any deterministic vector. Let ΣX = EPXXT ∈ RN×N be the covariance operator of the random input X . We assume ‖ΣX‖ <∞. A fundamental property that will be essential to our analysis is that, despite the fact that Z is nonlinear, the quantity [w1, w2]Z := EP {z(w1)z(w2)} is locally equivalent to the linear metric 〈w1, w2〉X = EP {wT1 XXTw2} = 〈w1,ΣXw2〉, and that the linearization error decreases with the angle between w1 and w2. Without loss of generality, we assume here that ‖w1‖ = ‖w2‖ = 1, and we write ‖w‖2Z = E{|z(w)|2}. Proposition 2.3. Let α = cos−1(〈w1, w2〉) be the angle between unitary vectors w1 and w2 and let wm =\nw1+w2 ‖w1+w2‖ be their unitary bisector. Then\n1 + cosα\n2 ‖wm‖2Z − 2‖ΣX‖\n( 1− cosα\n2 + sin2 α\n) ≤ [w1, w2]Z ≤ 1 + cosα\n2 ‖wm‖2Z . (7)\nThe term ‖ΣX‖ is overly pessimistic: we can replace it by the energy of X projected into the subspace spanned byw1 andw2 (which is bounded by 2‖ΣX‖). When α is small, a Taylor expansion of the trigonometric terms reveals that\n2\n3‖ΣX‖ 〈w1, w2〉 =\n2\n3‖ΣX‖ cosα =\n2 3‖ΣX‖ (1− α\n2\n2 +O(α4))\n≤ (1− α2/4)‖wm‖2Z − ‖ΣX‖(α2/4 + α2) +O(α4) ≤ [w1, w2]Z +O(α4) ,\nand similarly [w1, w2]Z ≤ 〈w1, w2〉‖wm‖2Z ≤ ‖ΣX‖〈w1, w2〉 .\nThe local behavior of parameters w1, w2 on our regression problem is thus equivalent to that of having a linear layer, provided w1 and w2 are sufficiently close to each other. This result can be seen as a spoiler of what is coming: increasing the hidden layer dimensionality m will increase the chances to encounter pairs of vectors w1, w2 with small angle; and with it some hope of approximating the previous linear behavior thanks to the small linearization error.\nIn order to control the connectedness, we need a last definition. Given a hidden layer of size m with current parameters W ∈ Rn×m, we define a “robust compressibility” factor as\nδW (l, α;m) = min ‖γ‖0≤l,supi |∠(w̃i,wi)|≤α\nE{|Y − γZ(W̃ )|2 + κ‖γ‖1} , (l ≤ m) . (8)\nThis quantity thus measures how easily one can compress the current hidden layer representation, by keeping only a subset of l its units, but allowing these units to move by a small amount controlled by α. It is a form of n-width similar to Kolmogorov width Donoho (2006) and is also related to robust sparse coding from Tang et al. (2013); Ekanadham et al. (2011)."}, {"heading": "2.3.3 MAIN RESULT", "text": "Our main result considers now a non-asymptotic scenario given by some fixed size m of the hidden layer. Given two parameter values θA = (WA1 ,W A 2 ) ∈ W and θB = (WB1 ,WB2 ) with Fo(θ {A,B}) ≤ λ, we show that there exists a continuous path γ : [0, 1] → W connecting θA and θB such that its oracle risk is uniformly bounded by max(λ, ), where decreases with model overparametrization.\nTheorem 2.4. For any θA, θB ∈ W and λ ∈ R satisfying Fo(θ{A,B}) ≤ λ, there exists a continuous path γ : [0, 1]→W such that γ(0) = θA, γ(1) = θB and\nFo(γ(t)) ≤ max(λ, ) , with (9)\n= inf l,α\n( max { e(l),δWA1 (m, 0;m), δWA1 (m− l, α;m), (10)\nδWB1 (m, 0;m), δWB1 (m− l, α;m) } + C1α+O(α 2) ) , (11)\nwhere C1 is an absolute constant depending only on κ and P .\nSome remarks are in order. First, our regularization term is currently a mix between `2 norm constraints on the first layer and `1 norm constraints on the second layer. We believe this is an artifact of our proof technique, and we conjecture that more general regularizations yield similar results. Next, this result uses the data distribution through the oracle bound e(m) and the covariance term. The extension to empirical risk is accomplished by replacing the probability measure P by the empirical measure P̂ = 1L ∑ l δ ((x, y)− (xl, yl)). However, our asymptotic analysis has to be carefully reexamined to take into account and avoid the trivial regime when M outgrows L. A consequence of Theorem 2.4 is that as m increases, the model becomes asymptotically connected, as proven in the following corollary.\nCorollary 2.5. As m increases, the energy gap satisfies = O(m− 1n ) and therefore the level sets become connected at all energy levels.\nThis is consistent with the overparametrization results from Safran & Shamir (2015); Shamir (2016) and the general common knowledge amongst deep learning practitioners. Our next sections explore this question, and refine it by considering not only topological properties but also some rough geometrical measure of the level sets."}, {"heading": "3 GEOMETRY OF LEVEL SETS", "text": ""}, {"heading": "3.1 THE GREEDY ALGORITHM", "text": "The intuition behind our main result is that, for smooth enough loss functions and for sufficient overparameterization, it should be “easy” to connect two equally powerful models—i.e., two models with FoθA,B ≤ λ. A sensible measure of this ease-of-connectedness is the normalized length of the geodesic connecting one model to the other: |γA,B(t)|/|θA − θB |. This length represents approximately how far of an excursion one must make in the space of models relative to the euclidean distance between a pair of models. Thus, convex models have a geodesic length of 1, because the geodesic is simply linear interpolation between models, while more non-convex models have geodesic lengths strictly larger than 1.\nBecause calculating the exact geodesic is difficult, we approximate the geodesic paths via a dynamic programming approach we call Dynamic String Sampling. We comment on alternative algorithms in Appendix A.\nFor a pair of models with network parameters θi, θj , each with Fe(θ) below a threshold L0, we aim to efficienly generate paths in the space of weights where the empirical loss along the path remains below L0. These paths are continuous curves belonging to ΩF (λ)–that is, the level sets of the loss function of interest.\nAlgorithm 1 Greedy Dynamic String Sampling 1: L0 ← Threshold below which path will be found 2: Φ1 ← randomly initialize θ1, train Φ(xi θ1) to L0 3: Φ2 ← randomly initialize θ2, train Φ(xi θ2) to L0 4: BeadList←(Φ1,Φ2) 5: Depth← 0 6: procedure FINDCONNECTION(Φ1,Φ2) 7: t∗ ← t such that dγ(θ1,θ2,t)dt ∣∣∣∣ t = 0 OR t = 0.5\n8: Φ3 ← train Φ(xi; t∗θ1 + (1− t∗)θ2) to L0 9: BeadList← insert(Φ3, after Φ1, BeadList)\n10: MaxError1 ← maxt(Fe(tθ3 + (1− t)θ1)) 11: MaxError2 ← maxt(Fe(tθ2 + (1− t)θ3)) 12: ifMaxError1 > L0 then return FindConnection(Φ1,Φ3) 13: ifMaxError2 > L0 then return FindConnection(Φ3,Φ2) 14: Depth← Depth+1\nThe algorithm recursively builds a string of models in the space of weights which continuously connect θi to θj . Models are added and trained until the pairwise linearly interpolated loss, i.e. maxtFe(tθi + (1 − t)θj) for t ∈ (0, 1), is below the threshold, L0, for every pair of neighboring models on the string. We provide a cartoon of the algorithm in Appendix C."}, {"heading": "3.2 FAILURE CONDITIONS AND PRACTICALITIES", "text": "While the algorithm presented will faithfully certify two models are connected if the algorithm converges, it is worth emphasizing that the algorithm does not guarantee that two models are disconnected if the algorithm fails to converge. In general, the problem of determining if two models are connected can be made arbitrarily difficult by choice of a particularly pathological geometry for the loss function, so we are constrained to heuristic arguments for determining when to stop running the algorithm. Thankfully, in practice, loss function geometries for problems of interest are not intractably difficult to explore. We comment more on diagnosing disconnections more carefully in Appendix E.\nFurther, if the MaxError exceeds L0 for every new recursive branch as the algorithm progresses, the worst case runtime scales as O(exp(Depth)). Empirically, we find that the number of new models added at each depth does grow, but eventually saturates, and falls for a wide variety of models and architectures, so that the typical runtime is closer to O(poly(Depth))—at least up until a critical value of L0.\nTo aid convergence, either of the choices in line 7 of the algorithm works in practice—choosing t∗ at a local maximum can provide a modest increase in algorithm runtime, but can be unstable if the the calculated interpolated loss is particularly flat or noisy. t∗ = .5 is more stable, but slower. Finally, we find that training Φ3 to αL0 for α < 1 in line 8 of the algorithm tends to aid convergence without noticeably impacting our numerics. We provide further implementation details in 4."}, {"heading": "4 NUMERICAL EXPERIMENTS", "text": "For our numerical experiments, we calculated normalized geodesic lengths for a variety of regression and classification tasks. In practice, this involved training a pair of randomly initialized models to the desired test loss value/accuracy/perplexity, and then attempting to connect that pair of models via the Dynamic String Sampling algorithm. We also tabulated the average number of “beads”, or the number intermediate models needed by the algorithm to connect two initial models. For all of the below experiments, the reported losses and accuracies are on a restricted test set. For more complete architecture and implementation details, see our GitHub page.\nThe results are broadly organized by increasing model complexity and task difficulty, from easiest to hardest. Throughout, and remarkably, we were able to easily connect models for every dataset and architecture investigated except the one explicitly constructed counterexample discussed in Appendix E.1. Qualitatively, all of the models exhibit a transition from a highly convex regime at high loss to a non-convex regime at low loss, as demonstrated by the growth of the normalized length as well as the monotonic increase in the number of required “beads” to form a low-loss connection."}, {"heading": "4.1 POLYNOMIAL REGRESSION", "text": "We studied a 1-4-4-1 fully connected multilayer perceptron style architecture with sigmoid nonlinearities and RMSProp/ADAM optimization. For ease-of-analysis, we restricted the training and test data to be strictly contained in the interval x ∈ [0, 1] and f(x) ∈ [0, 1]. The number of required beads, and thus the runtime of the algorithm, grew approximately as a power-law, as demonstrated in Table 1 Fig. 1. We also provide a visualization of a representative connecting path between two models of equivalent power in Appendix D.\nThe cubic regression task exhibits an interesting feature around L0 = .15 in Table 1 Fig. 2, where the normalized length spikes, but the number of required beads remains low. Up until this point, the\ncubic model is strongly convex, so this first spike seems to indicate the onset of non-convex behavior and a concomitant radical change in the geometry of the loss surface for lower loss."}, {"heading": "4.2 CONVOLUTIONAL NEURAL NETWORKS", "text": "To test the algorithm on larger architectures, we ran it on the MNIST hand written digit recognition task as well as the CIFAR10 image recognition task, indicated in Table 1, Figs. 3 and 4. Again, the data exhibits strong qualitative similarity with the previous models: normalized length remains low until a threshold loss value, after which it grows approximately as a power law. Interestingly, the MNIST dataset exhibits very low normalized length, even for models nearly at the state of the art in classification power, in agreement with the folk-understanding that MNIST is highly convex and/or “easy”. The CIFAR10 dataset, however, exhibits large non-convexity, even at the modest test accuracy of 80%."}, {"heading": "4.3 RECURRENT NEURAL NETWORKS", "text": "To gauge the generalizability of our algorithm, we also applied it to an LSTM architecture for solving the next word prediction task on the PTB dataset, depicted in Table 1 Fig. 5. Noteably, even for a radically different architecture, loss function, and data set, the normalized lengths produced by the DSS algorithm recapitulate the same qualitative features seen in the above datasets—i.e., models can be easily connected at high perplexity, and the normalized length grows at lower and lower perplexity after a threshold value, indicating an onset of increased non-convexity of the loss surface."}, {"heading": "5 DISCUSSION", "text": "We have addressed the problem of characterizing the loss surface of neural networks from the perspective of gradient descent algorithms. We explored two angles – topological and geometrical aspects – that build on top of each other.\nOn the one hand, we have presented new theoretical results that quantify the amount of uphill climbing that is required in order to progress to lower energy configurations in single hidden-layer ReLU networks, and proved that this amount converges to zero with overparametrization under mild conditions. On the other hand, we have introduced a dynamic programming algorithm that efficiently approximates geodesics within each level set, providing a tool that not only verifies the connectedness of level sets, but also estimates the geometric regularity of these sets. Thanks to this information, we can quantify how ‘non-convex’ an optimization problem is, and verify that the optimization of quintessential deep learning tasks – CIFAR-10 and MNIST classification using CNNs, and next word prediction using LSTMs – behaves in a nearly convex fashion up until they reach high accuracy levels.\nThat said, there are some limitations to our framework. In particular, we do not address saddle-point issues that can greatly affect the actual convergence of gradient descent methods. There are also a number of open questions; amongst those, in the near future we shall concentrate on:\n• Extending Theorem 2.4 to the multilayer case. We believe this is within reach, since the main analytic tool we use is that small changes in the parameters result in small changes in the covariance structure of the features. That remains the case in the multilayer case.\n• Empirical versus Oracle Risk. A big limitation of our theory is that right now it does not inform us on the differences between optimizing the empirical risk versus the oracle risk. Understanding the impact of generalization error and stochastic gradient in the ability to do small uphill climbs is an open line of research.\n• Influence of symmetry groups. Under appropriate conditions, the presence of discrete symmetry groups does not prevent the loss from being connected, but at the expense of increasing the capacity. An important open question is whether one can improve the asymptotic properties by relaxing connectedness to being connected up to discrete symmetry.\n• Improving numerics with Hyperplane method. Our current numerical experiments employ a greedy (albeit faster) algorithm to discover connected components and estimate geodesics. We plan to perform experiments using the less greedy algorithm described in Appendix A."}, {"heading": "ACKNOWLEDGMENTS", "text": "We would like to thank Mark Tygert for pointing out the reference to the -nets and Kolmogorov capacity, and Martin Arjovsky for spotting several bugs in early version of the results. We would also like to thank Maithra Raghu and Jascha Sohl-Dickstein for enlightening discussions, as well as Yasaman Bahri for helpful feedback on an early version of the manuscript. CDF was supported by the NSF Graduate Research Fellowship under Grant DGE-1106400."}, {"heading": "A CONSTRAINED DYNAMIC STRING SAMPLING", "text": "While the algorithm presented in Sec. 3.1 is fast for sufficiently smooth families of loss surfaces with few saddle points, here we present a slightly modified version which, while slower, provides more control over the convergence of the string. We did not use the algorithm presented in this section for our numerical studies.\nInstead of training intermediate models via full SGD to a desired accuracy as in step 8 of the algorithm, intermediate models are be subject to a constraint that ensures they are “close” to the neighboring models on the string. Specifically, intermediate models are constrained to the unique hyperplane in weightspace equidistant from its two neighbors. This can be further modified by additional regularization terms to control the “springy-ness” of the string. These heuristics could be chosen to try to more faithfully sample the geodesic between two models.\nIn practice, for a given model on the string, θi, these two regularizations augment the standard loss by: F̃ (θ) = F (θ) + ζ(‖θi−1− θi‖+ ‖θi+1− θi‖) +κ‖ (θi−1−θi+1)/2‖(θi−1−θi+1)/2‖ · (θi−(θi−1−θi+1)/2) ‖(θi−(θi−1−θi+1)/2)‖‖. The ζ regularization term controls the “springy-ness” of the weightstring, and the κ regularization term controls how far off the hyperplane a new model can deviate.\nBecause adapting DSS to use this constraint is straightforward, here we will describe an alternative “breadth-first” approach wherein models are trained in parallel until convergence. This alternative approach has the advantage that it will indicate a disconnection between two models “sooner” in training. The precise geometry of the loss surface will dictate which approach to use in practice.\nGiven two random models σi and σj where |σi − σj | < L0, we aim to follow the evolution of the family of models connecting σi to σj . Intuitively, almost every continuous path in the space of random models connecting σi to σj has, on average, the same (high) loss. For simplicity, we choose to initialize the string to the linear segment interpolating between these two models. If this entire segment is evolved via gradient descent, the segment will either evolve into a string which is entirely contained in a basin of the loss surface, or some number of points will become fixed at a higher loss. These fixed points are difficult to detect directly, but will be indirectly detected by the persistence of a large interpolated loss between two adjacent models on the string.\nThe algorithm proceeds as follows:\n(0.) Initialize model string to have two models, σi and σj .\n1. Begin training all models to the desired loss, keeping the instantaneous loss, L0(t), of all models being trained approximately constant.\n2. If the pairwise interpolated loss between σn and σn+1 exceeds L0(t), insert a new model at the maximum of the interpolated loss (or halfway) between these two models.\n3. Repeat steps (1) and (2) until all models (and interpolated errors) are below a threshold loss L0(tfinal) := L0, or until a chosen failure condition (see 3.2)."}, {"heading": "B PROOFS", "text": "B.1 PROOF OF PROPOSITION 2.1\nSuppose that θ1 is a local minima and θ2 is a global minima, but F (θ1) > F (θ2). If λ = F (θ1), then clearly θ1 and θ2 both belong to ΩF (λ). Suppose now that ΩF (λ) is connected. Then we\ncould find a smooth (i.e. continuous and differentiable) path γ(t) with γ(0) = θ1, γ(1) = θ2 and F (γ(t)) ≤ λ = F (θ1). But this contradicts the strict local minima status of θ1, and therefore ΩF (λ) cannot be connected .\nB.2 PROOF OF PROPOSITION 2.2\nLet us first consider the case with κ = 0. We proceed by induction over the number of layers K. For K = 1, the loss F (θ) is convex. Let θA, θB be two arbitrary points in a level set Ωλ. Thus F (θA) ≤ λ and F (θB) ≤ λ. By definition of convexity, a linear path is sufficient in that case to connect θA and θB :\nF ((1− t)θA + tθB) ≤ (1− t)F (θA) + tF (θB) ≤ λ . Suppose the result is true for K − 1. Let θA = (WA1 , . . . ,WAK ) and θB = (WB1 , . . . ,WBK ) with F (θA) ≤ λ, F (θB) ≤ λ. Since nj ≥ min(n1, nK) for j = 2 . . .K − 1, we can find k∗ = {1,K − 1} such that nk∗ ≥ min(nk∗−1, nk∗+1). For each W1, . . . ,WK , we denote W̃j = Wj for j 6= k∗, k∗ − 1 and W̃k∗ = Wk∗−1Wk∗ . By induction hypothesis, the loss expressed in terms of θ̃ = (W̃1, . . . , W̃K−1) is connected between θ̃A and θ̃B . Let W̃k∗(t) the corresponding linear path projected in the layer k∗. We need to produce a path in the variables Wk∗−1(t), Wk∗(t) such that:\ni Wk∗−1(0) = WAk∗−1, Wk∗−1(1) = W B k∗−1,\nii Wk∗(0) = WAk∗ , Wk∗(1) = W B k∗ ,\niii Wk∗(t)Wk∗−1(t) = W̃k∗−1(t) for t ∈ (0, 1).\nWe construct it as follows. Let\nWk∗(t) = tW B k∗ + (1− t)WAk∗ + t(1− t)V ,\nWk∗−1(t) = Wk∗(t) †W̃k∗−1(t) ,\nwhere Wk∗(t)† = (Wk∗(t)TWk∗(t))−1Wk∗(t)T denotes the pseudoinverse and V is a nk∗−1×nk∗ matrix drawn from a iid distribution. Conditions (i) and (ii) are immediate from the definition, and condition (iii) results from the fact that\nWk∗(t)Wk∗(t) † = IN∗k ,\nsince W ∗k (t) has full rank for all t ∈ (0, 1). Finally, let us prove that the result is also true when K = 2 and κ > 0. We construct the path using the variational properties of atomic norms Bach (2013). When we pick the ridge regression regularization, the corresponding atomic norm is the nuclear norm:\n‖X‖∗ = min UV T=X\n1 2 (‖U‖2 + ‖V ‖2) .\nThe path is constructed by exploiting the convexity of the variational norm ‖X‖∗. Let θA = (WA1 ,W A 2 ) and θ B = (WB1 ,W B 2 ), and we define W̃ = W1W2. Since W̃ {A,B} = W {A,B} 1 W {A,B} 2 , it results that\n‖W̃ {A,B}‖∗ ≤ 1 2 (‖W {A,B}1 ‖2 + ‖W {A,B} 2 ‖2) . (12)\nFrom (12) it results that the loss Fo(W1,W2) can be minored by another loss expressed in terms of W̃ of the form E{|Y − W̃X|2}+ 2κ‖W̃‖∗ , which is convex with respect to W̃ . Thus a linear path in W̃ from W̃A to W̃B is guaranteed to be below Fo(θ{A,B}). Let us define\n∀ t , W1(t),W2(t) = arg min UV T=W̃ (t) (‖U‖2 + ‖V ‖2) .\nOne can verify that we can first consider a path (βA1 (s), β A 2 (s)) from (W A 1 ,W A 2 ) to (W1(0),W2(0) such that ∀ s β1(s)β2(s) = W̃A and ‖β1(s)‖2 + ‖β2(s)‖2 decreases ,\nand similarly for (WB1 ,W B 2 ) to (W1(1),W2(1). The path (β A {1,2}(s),W{1,2}(t), β B {1,2}(s)) satisfies (i-iii) by definition. We also verify that\n‖W1(t)‖2 + ‖W2(t)‖2 = 2‖W̃ (t)‖∗ ≤ 2(1− t)‖W̃ (0)‖∗ + 2t‖W̃ (1)‖∗ ≤ (1− t)(‖W‖21(0) + ‖W‖22(0)) + t(‖W‖21(1) + ‖W‖22(1)) .\nFinally, we verify that the paths we have just created, when applied to θA arbitrary and θB = θ∗ a global minimum, are strictly decreasing, again by induction. For K = 1, this is again an immediate consequence of convexity. ForK > 1, our inductive construction guarantees that for any 0 < t < 1, the path θ(t) = (Wk(t))k≤K satisfies Fo(θ(t)) < Fo(θA). This concludes the proof .\nB.3 PROOF OF PROPOSITION 2.3\nLet A(w1, w2) = {x ∈ Rn; 〈x,w1〉 ≥ 0 , 〈x,w2〉 ≥ 0} .\nBy definition, we have\n〈w1, w2〉Z = E{max(0, 〈X,w1〉) max(0, 〈X,w2〉)} (13)\n= ∫ A(w1,w2) 〈x,w1〉〈x,w2〉dP (x) , (14)\n= ∫ Q(A(w1,w2)) 〈Q(x), w1〉〈Q(x), w2〉(dP̄ (Q(x))) , (15)\nwhereQ is the orthogonal projection onto the space spanned byw1 andw2 and dP̄ (x) = dP̄ (x1, x2) is the marginal density on that subspace. Since this projection does not interfere with the rest of the proof, we abuse notation by dropping the Q and still referring to dP (x) as the probability density.\nNow, let r = 12‖w1 + w2‖ = 1+cos(α) 2 and d = w2−w1 2 . By construction we have\nw1 = rwm − d , w2 = rwm + d , and thus 〈x,w1〉〈x,w2〉 = r2|〈x,wm〉|2 − |〈x, d〉|2 . (16) By denoting C(wm) = {x ∈ Rn; 〈x,wm〉 ≥ 0}, observe that A(w1, w2) ⊆ C(wm). Let us denote by B = C(wm) \\A(w1, w2) the disjoint complement. It results that\n〈w1, w2〉Z = ∫ A(w1,w2) 〈x,w1〉〈x,w2〉dP (x)\n= ∫ C(wm) [r2|〈x,wm〉|2 − |〈x, d〉|2]dP (x)−\nr2 ∫ B |〈x,wm〉|2dP (x) + ∫ B |〈x, d〉|2dP (x)\n= r2‖wm‖2Z − r2 ∫ B\n|〈x,wm〉|2dP (x)︸ ︷︷ ︸ E1\n− ∫ A(w1,w2)\n|〈x, d〉|2dP (x)︸ ︷︷ ︸ E2 . (17)\nWe conclude by bounding each error term E1 and E2 separately: 0 ≤ E1 ≤ r2| sin(α)|2 ∫ B ‖x‖2dP (x) ≤ r2| sin(α)|22‖ΣX‖ , (18)\nsince every point in B by definition has angle greater than π/2− α from wm. Also, 0 ≤ E2 ≤ ‖d‖2 ∫ A(w1,w2) ‖x‖2dP (x) ≤ 1− cos(α) 2 2‖ΣX‖ (19)\nby direct application of Cauchy-Schwartz. The proof is completed by plugging the bounds from (18) and (19) into (17) .\nB.4 PROOF OF THEOREM 2.4\nConsider a generic α and l ≤ m. A path from θA to θB will be constructed by concatenating the following paths:\n1. from θA to θlA, the best linear predictor using the same first layer as θA,\n2. from θlA to θsA, the best (m− l)-term approximation using perturbed atoms from θA, 3. from θsA to θ∗ the oracle l term approximation,\n4. from θ∗ to θsB , the best (m− l)-term approximation using perturbed atoms from θB , 5. from θsB to θlB , the best linear predictor using the same first layer as θB ,\n6. from θlB to θB .\nThe proof will study the increase in the loss along each subpath and aggregate the resulting increase into a common bound.\nSubpaths (1) and (6) only involve changing the parameters of the second layer while leaving the firstlayer weights fixed, which define a convex loss. Therefore a linear path is sufficient to guarantee that the loss along that path will be upper bounded by λ on the first end and δWA1 (m, 0,m) on the other end.\nConcerning subpaths (3) and (4), we notice that they can also be constructed using only parameters of the second layer, by observing that one can fit into a single n × m parameter matrix both the (m − l)-term approximation and the oracle l-term approximation. Indeed, let us describe subpath (3) in detail ( subpath (4) is constructed analogously by replacing the role of θsA with θsB). Let W̃A the first-layer parameter matrix associated with the m − l-sparse solution θsA, and let γA denote its second layer coefficients, which is a m-dimensional vector with at most m − l non-zero coefficients. LetW∗ be the first-layer matrix of the l-term oracle approximation, and γ∗ the corresponding second-layer coefficients. Since there are only m − l columns of W̃A that are used, corresponding to the support of γA, we can consider a path θ̄ that replaces the remaining l columns with those from W∗ while keeping the second-layer vector γA fixed. Since the modified columns correspond to zeros in γA, such paths have constant loss. Call W̄ the resulting first-layer matrix, containing both the active m− l active columns of W̃A and the l columns of W∗ in the positions determined by the zeros of γA. Now we can consider the linear subpath that interpolates between γA and γ∗ while keeping the first layer fixed at W̄ . Since again this is a linear subpath that only moves second-layer coefficients, it is non-increasing thanks to the convexity of the loss while fixing the first layer. We easily verify that at the end of this linear subpath we are using the oracle l-term approximation, which has loss e(l), and therefore subpath (3) incurs in a loss that is bounded by its extremal values δWA1 (m− l, α,m) and e(l).\nFinally, we need to show how to construct the subpaths (2) and (5), which are the most delicate step since they cannot be bounded using convexity arguments as above. Let W̃A be the resulting perturbed first-layer parameter matrix withm− l sparse coefficients γA. Let us consider an auxiliary regression of the form W = [WA; W̃A] ∈ Rn×2m . and regression parameters\nβ1 = [β1; 0] , β2 = [0; γA] .\nClearly E{|Y − β1W |2}+ κ‖β1‖1 = E{|Y − β1WA|2}+ κ‖β1‖1\nand similarly for β2. By convexity, the augmented linear path η(t) = (1− t)β1 + tβ2 thus satisfies\n∀ t , L(t) = E{|Y − η(t)W |2}+ κ‖η(t)‖1 ≤ max(L(0), L(1)) .\nLet us now approximate this augmented linear path with a path in terms of first and second layer weights. We consider\nη1(t) = (1− t)WA + tW̃A , and η2(t) = (1− t)β1 + tγA .\nWe have that\nFo({η1(t), η2(t)}) = E{|Y − η2(t)Z(η1(t))|2}+ κ‖η2(t)‖1 (20) ≤ E{|Y − η2(t)Z(η1(t))|2}+ κ((1− t)‖β1‖1 + t‖γA‖1) = L(t) + E{|Y − η2(t)Z(η1(t))|2} − E{|Y − (1− t)β1Z(WA)− tγAZ(W̃A)|2} . (21)\nFinally, we verify that∣∣∣E{|Y − η2(t)Z(η1(t))|2} − E{|Y − (1− t)β1Z(WA)− tγAZ(W̃A)|2}∣∣∣ ≤ (22) ≤ 4αmax(E|Y |2, √ E|Y 2|)‖ΣX‖(κ−1/2 + α √ E|Y 2|κ−1) + o(α2) .\nIndeed, from Proposition 2.3, and using the fact that ∀ i ≤M, t ∈ [0, 1] , ∣∣∠((1− t)wAi + tw̃Ai ;wAi )∣∣ ≤ α , ∣∣∠((1− t)wAi + tw̃Ai ; w̃Ai )∣∣ ≤ α\nwe can write (1− t)β1,iz(wAi ) + tγA,iz(w̃Ai ) d = η2(t)iz(η1(t)i) + ni ,\nwith E{|ni|2} ≤ 4|η2(t)i|2‖ΣX‖α2 + O(α4) and E|ni| ≤ 2|η2(t)i|α √ ‖ΣX‖ using concavity of the moments. Thus∣∣∣E{|Y − η2(t)Z(η1(t))|2} − E{|Y − (1− t)β1Z(WA)− tγAZ(W̃A)|2}∣∣∣ ≤ 2E\n{∑ i (Y − η2(t)Z(η1(t)))ni } + E { | ∑ i ni|2 }\n≤ 4 ( α √ E|Y 2|‖ΣX‖‖η2‖+ α2(‖η2‖1)2‖ΣX‖ ) ≤ 4αmax(1, √ E|Y 2|)‖ΣX‖(‖η2‖1 + α‖η2‖21) + o(α2)\n≤ 4αmax( √ E|Y 2|,E|Y 2|)‖ΣX‖(κ−1 + α √ E|Y 2|κ−2) + o(α2) ,\nwhich proves (22).\nWe have just constructed a path from θA to θB , in which all subpaths except (2) and (5) have energy maximized at the extrema due to convexity, given respectively by λ, δW 1A(m, 0,m), δW 1A(m − l, α,m), e(l), δW 1B (m − l, α,m), and δW 1B (m, 0,m). For the two subpaths (2) and (5), (22) shows that it is sufficient to add the corresponding upper bound to the linear subpath, which is of the form Cα + o(α2) where C is an explicit constant independent of θ. Since l and α are arbitrary, we are free to pick the infimum, which concludes the proof.\nB.5 PROOF OF COROLLARY 2.5\nLet us consider a generic first layer weight matrix W ∈ Rn×m. Without loss of generality, we can assume that ‖wk‖ = 1 for all k, since increasing the norm of ‖wk‖within the unit ball has no penalty in the loss, and we can compensate this scaling in the second layer thanks to the homogeneity of the half-rectification. Since this results in an attenuation of these second layer weights, they too are guaranteed not to increase the loss.\nFrom Vershynin (2010) [Lemma 5.2] we verify that the covering number N (Sn−1, ) of the Euclidean unit sphere Sn−1 satisfies\nN (Sn−1, ) ≤ ( 1 + 2 )n ,\nwhich means that we can cover the unit sphere with an -net of size N (Sn−1, ).\nLet 0 < η < n−1(1 + n−1)−1, and let us pick, for each m, m = m η−1 n . Let us consider its corresponding -net of size\num = N (Sn−1, m) ' ( 1 + 2\nm\n)n ' m1−η .\nSince we have m vectors in the unit sphere, it results from the pigeonhole principle that at least one element of the net will be associated with at least vm = mu−1m ' mη vectors; in other words, we are guaranteed to find amongst our weight vector W a collection Qm of vm ' mη vectors that are all at an angle at most 2 m apart. Let us now apply Theorem 2.4 by picking n = vm and α = m. We need to see that the terms involved in the bound all converge to 0 as m→∞. The contribution of the oracle error e(vm) − e(m) goes to zero as m → ∞ by the fact that limm→∞ e(m) exists (it is a decreasing, positive sequence) and that vm →∞. Let us now verify that δ(m − vm, m,m) also converges to zero. We are going to prune the first layer by removing one by one the vectors in Qm. Removing one of these vectors at a time incurs in an error of the order of m. Indeed, let wk be one of such vectors and let β′ be the solution of\nmin β′ E(β′) = min β′=(βf ;βk)∈Rk E{|Y − βTf Z(W−k)− βkz(wk)|2}+ κ(‖βf‖1 + |βk|) ,\nwhere W−k is a shorthand for the matrix containing the rest of the vectors that have not been discarded yet. Removing the vector wk from the first layer increases the loss by a factor that is upper bounded by E(βp)− E(β), where\n(βp)j =\n{ β′j for j < k − 1 ,\nβ′k−1 + β ′ k otherwise.\n,\nsince now βp is a feasible solution for the pruned first layer.\nLet us finally bound E(βp)− E(β). Since ∠(wk, wk−1) ≤ m, it results from Proposition 2.3 that\nz(wk) d = z(wk−1) + n ,\nwith E{|n|2} ≤ Cα2 for some constantC independent ofm. By redefining p1 = Y −βTp Z(W−k)− 1 2n and p2 = 1 2n, we have\nE{|Y − βTp Z(W−k)|2} − E{|Y − β′ T Z(W−k)− βkz(wk)|2}\n= E{|p1 + p2|2} − E{|p1 − p2|2} = 4E{|p1p2|}\n≤ √√√√E{∣∣∣∣Y − βTp Z(W−k)− 12n ∣∣∣∣2 }√ E{|n|2}\n≤ (C + α)α ' m ,\nwhere C only depends on E{|Y |2}. We also verify that ‖βp‖1 ≤ ‖β′‖1. It results that removing |Qm| of such vectors incurs an increase of the loss at most |Qm| m ' mηm η−1 n = mη+\nη−1 n . Since we picked η such that η + η−1n < 0, this term converges to zero. The\nproof is finished."}, {"heading": "C CARTOON OF ALGORITHM", "text": "Refer to Fig. 2.\nD VISUALIZATION OF CONNECTION\nBecause the weight matrices are anywhere from high to extremely high dimensional, for the purposes of visualization we projected the models on the connecting path into a three dimensionsal subspace. Snapshots of the algorithm in progress for the quadratic regression task are indicated in Fig. 3. This was done by vectorizing all of the weight matrices for all the beads for a given connecting path, and then performing principal component analysis to find the three highest weight projections for the collection of models that define the endpoints of segments for a connecting path—i.e., the\nθi discussed in the algorithm. We then projected the connecting string of models onto these three directions.\nThe color of the strings was chosen to be representative of the test loss under a log mapping, so that extremely high test loss mapped to red, whereas test loss near the threshold mapped to blue. An animation of the connecting path can be seen on our Github page.\nFinally, projections onto pairs of principal components are indicated by the black curves."}, {"heading": "E A DISCONNECTION", "text": "E.1 A DISCONNECTION\nAs a sanity check for the algorithm, we also applied it to a problem for which we know that it is not possible to connect models of equivalent power by the arguments of section 2.3.1. The input data is 3 points in R2, and the task is to permute the datapoints, i.e. map {x1, x2, x3} → {x2, x3, x1}. This map requires at least 12 parameters in general for the three linear maps which take xi → xj for i, j ∈ {{1, 2}, {2, 3}, {3, 1}}. Our archticture was a 2-3-2 fully connected neural network with a single relu nonlinearity after the hidden layer—a model which clearly has 12 free parameters by construction. The two models we tried to connect were a single model, θ, and a copy of θ with the first two neurons in the hidden layer permuted, θ̃σ . The algorithm fails to converge when initialized with these two models. We provide a visualization of the string of models produced by the algorithm in Fig. 4.\nIn general, a persistent high interpolated loss between two neighboring beads on the string of models could arise from either a slowly converging, connected pair of models or from a truly disconnected pair of models. “Proving” a disconnection at the level of numerical experiments is intractable in general, but a collection of negative results—i.e., failures to converge—are highly suggestive of a true disconnection."}], "references": [{"title": "Convex relaxations of structured matrix factorizations", "author": ["Francis Bach"], "venue": "arXiv preprint arXiv:1309.3117,", "citeRegEx": "Bach.,? \\Q2013\\E", "shortCiteRegEx": "Bach.", "year": 2013}, {"title": "The loss surfaces of multilayer networks", "author": ["Anna Choromanska", "Mikael Henaff", "Michael Mathieu", "Gérard Ben Arous", "Yann LeCun"], "venue": "In Proc. AISTATS,", "citeRegEx": "Choromanska et al\\.,? \\Q2015\\E", "shortCiteRegEx": "Choromanska et al\\.", "year": 2015}, {"title": "Identifying and attacking the saddle point problem in high-dimensional non-convex optimization", "author": ["Yann N Dauphin", "Razvan Pascanu", "Caglar Gulcehre", "Kyunghyun Cho", "Surya Ganguli", "Yoshua Bengio"], "venue": "In Advances in Neural Information Processing Systems,", "citeRegEx": "Dauphin et al\\.,? \\Q2014\\E", "shortCiteRegEx": "Dauphin et al\\.", "year": 2014}, {"title": "Compressed sensing", "author": ["David L Donoho"], "venue": "IEEE Transactions on information theory,", "citeRegEx": "Donoho.,? \\Q2006\\E", "shortCiteRegEx": "Donoho.", "year": 2006}, {"title": "Adaptive subgradient methods for online learning and stochastic optimization", "author": ["John Duchi", "Elad Hazan", "Yoram Singer"], "venue": "Journal of Machine Learning Research,", "citeRegEx": "Duchi et al\\.,? \\Q2011\\E", "shortCiteRegEx": "Duchi et al\\.", "year": 2011}, {"title": "Recovery of sparse translationinvariant signals with continuous basis pursuit", "author": ["Chaitanya Ekanadham", "Daniel Tranchina", "Eero P Simoncelli"], "venue": "IEEE transactions on signal processing,", "citeRegEx": "Ekanadham et al\\.,? \\Q2011\\E", "shortCiteRegEx": "Ekanadham et al\\.", "year": 2011}, {"title": "Qualitatively characterizing neural network optimization problems", "author": ["Ian J Goodfellow", "Oriol Vinyals", "Andrew M Saxe"], "venue": "arXiv preprint arXiv:1412.6544,", "citeRegEx": "Goodfellow et al\\.,? \\Q2014\\E", "shortCiteRegEx": "Goodfellow et al\\.", "year": 2014}, {"title": "Lecture 6a overview of mini–batch gradient descent", "author": ["Geoffrey Hinton", "N Srivastava", "Kevin Swersky"], "venue": "Coursera Class,", "citeRegEx": "Hinton et al\\.,? \\Q2012\\E", "shortCiteRegEx": "Hinton et al\\.", "year": 2012}, {"title": "Batch normalization: Accelerating deep network training by reducing internal covariate shift", "author": ["Sergey Ioffe", "Christian Szegedy"], "venue": "arXiv preprint arXiv:1502.03167,", "citeRegEx": "Ioffe and Szegedy.,? \\Q2015\\E", "shortCiteRegEx": "Ioffe and Szegedy.", "year": 2015}, {"title": "Deep learning without poor local minima", "author": ["Kenji Kawaguchi"], "venue": "arXiv preprint arXiv:1605.07110,", "citeRegEx": "Kawaguchi.,? \\Q2016\\E", "shortCiteRegEx": "Kawaguchi.", "year": 2016}, {"title": "Adam: A method for stochastic optimization", "author": ["Diederik Kingma", "Jimmy Ba"], "venue": "arXiv preprint arXiv:1412.6980,", "citeRegEx": "Kingma and Ba.,? \\Q2014\\E", "shortCiteRegEx": "Kingma and Ba.", "year": 2014}, {"title": "Gradient descent converges to minimizers", "author": ["Jason D Lee", "Max Simchowitz", "Michael I Jordan", "Benjamin Recht"], "venue": "University of California, Berkeley,", "citeRegEx": "Lee et al\\.,? \\Q2016\\E", "shortCiteRegEx": "Lee et al\\.", "year": 2016}, {"title": "On the quality of the initial basin in overspecified neural networks", "author": ["Itay Safran", "Ohad Shamir"], "venue": "arXiv preprint arXiv:1511.04210,", "citeRegEx": "Safran and Shamir.,? \\Q2015\\E", "shortCiteRegEx": "Safran and Shamir.", "year": 2015}, {"title": "Explorations on high dimensional landscapes", "author": ["Levent Sagun", "V Ugur Guney", "Gerard Ben Arous", "Yann LeCun"], "venue": "arXiv preprint arXiv:1412.6615,", "citeRegEx": "Sagun et al\\.,? \\Q2014\\E", "shortCiteRegEx": "Sagun et al\\.", "year": 2014}, {"title": "Exact solutions to the nonlinear dynamics of learning in deep linear neural networks", "author": ["Andrew M Saxe", "James L McClelland", "Surya Ganguli"], "venue": "arXiv preprint arXiv:1312.6120,", "citeRegEx": "Saxe et al\\.,? \\Q2013\\E", "shortCiteRegEx": "Saxe et al\\.", "year": 2013}, {"title": "Distribution-specific hardness of learning neural networks", "author": ["Ohad Shamir"], "venue": null, "citeRegEx": "Shamir.,? \\Q2016\\E", "shortCiteRegEx": "Shamir.", "year": 2016}, {"title": "No bad local minima: Data independent training error guarantees for multilayer neural networks", "author": ["Daniel Soudry", "Yair Carmon"], "venue": "arXiv preprint arXiv:1605.08361,", "citeRegEx": "Soudry and Carmon.,? \\Q2016\\E", "shortCiteRegEx": "Soudry and Carmon.", "year": 2016}, {"title": "Local minima in training of neural networks", "author": ["Grzegorz Swirszcz", "Wojciech Marian Czarnecki", "Razvan Pascanu"], "venue": "arXiv preprint arXiv:1611.06310,", "citeRegEx": "Swirszcz et al\\.,? \\Q2016\\E", "shortCiteRegEx": "Swirszcz et al\\.", "year": 2016}], "referenceMentions": [{"referenceID": 2, "context": "The empirical performance of SGD on these models is better than one could expect in generic, arbitrary non-convex loss surfaces, often aided by modifications yielding significant speedups Duchi et al. (2011); Hinton et al.", "startOffset": 188, "endOffset": 208}, {"referenceID": 2, "context": "The empirical performance of SGD on these models is better than one could expect in generic, arbitrary non-convex loss surfaces, often aided by modifications yielding significant speedups Duchi et al. (2011); Hinton et al. (2012); Ioffe & Szegedy (2015); Kingma & Ba (2014).", "startOffset": 188, "endOffset": 230}, {"referenceID": 2, "context": "The empirical performance of SGD on these models is better than one could expect in generic, arbitrary non-convex loss surfaces, often aided by modifications yielding significant speedups Duchi et al. (2011); Hinton et al. (2012); Ioffe & Szegedy (2015); Kingma & Ba (2014).", "startOffset": 188, "endOffset": 254}, {"referenceID": 2, "context": "The empirical performance of SGD on these models is better than one could expect in generic, arbitrary non-convex loss surfaces, often aided by modifications yielding significant speedups Duchi et al. (2011); Hinton et al. (2012); Ioffe & Szegedy (2015); Kingma & Ba (2014). This raises a number of theoretical questions as to why neural network optimization does not suffer in practice from poor local minima.", "startOffset": 188, "endOffset": 274}, {"referenceID": 1, "context": "Recent work has explored models from statistical physics such as spin glasses Choromanska et al. (2015), in order to understand the macroscopic properties of the system, but at the expense of strongly simplifying the nonlinear nature of the model.", "startOffset": 78, "endOffset": 104}, {"referenceID": 1, "context": "Recent work has explored models from statistical physics such as spin glasses Choromanska et al. (2015), in order to understand the macroscopic properties of the system, but at the expense of strongly simplifying the nonlinear nature of the model. Other authors have advocated that the real danger in high-dimensional setups are saddle points rather than poor local minima Dauphin et al. (2014), although recent results rigorously establish that gradient descent does not get stuck on saddle points Lee et al.", "startOffset": 78, "endOffset": 395}, {"referenceID": 1, "context": "Recent work has explored models from statistical physics such as spin glasses Choromanska et al. (2015), in order to understand the macroscopic properties of the system, but at the expense of strongly simplifying the nonlinear nature of the model. Other authors have advocated that the real danger in high-dimensional setups are saddle points rather than poor local minima Dauphin et al. (2014), although recent results rigorously establish that gradient descent does not get stuck on saddle points Lee et al. (2016) but merely slowed down.", "startOffset": 78, "endOffset": 517}, {"referenceID": 1, "context": "Recent work has explored models from statistical physics such as spin glasses Choromanska et al. (2015), in order to understand the macroscopic properties of the system, but at the expense of strongly simplifying the nonlinear nature of the model. Other authors have advocated that the real danger in high-dimensional setups are saddle points rather than poor local minima Dauphin et al. (2014), although recent results rigorously establish that gradient descent does not get stuck on saddle points Lee et al. (2016) but merely slowed down. Other notable recent contributions are Kawaguchi (2016), which further develops the spin-glass connection from Choromanska et al.", "startOffset": 78, "endOffset": 597}, {"referenceID": 1, "context": "Recent work has explored models from statistical physics such as spin glasses Choromanska et al. (2015), in order to understand the macroscopic properties of the system, but at the expense of strongly simplifying the nonlinear nature of the model. Other authors have advocated that the real danger in high-dimensional setups are saddle points rather than poor local minima Dauphin et al. (2014), although recent results rigorously establish that gradient descent does not get stuck on saddle points Lee et al. (2016) but merely slowed down. Other notable recent contributions are Kawaguchi (2016), which further develops the spin-glass connection from Choromanska et al. (2015) and resolves the linear case by showing that no poor local minima exist; Sagun et al.", "startOffset": 78, "endOffset": 678}, {"referenceID": 1, "context": "Recent work has explored models from statistical physics such as spin glasses Choromanska et al. (2015), in order to understand the macroscopic properties of the system, but at the expense of strongly simplifying the nonlinear nature of the model. Other authors have advocated that the real danger in high-dimensional setups are saddle points rather than poor local minima Dauphin et al. (2014), although recent results rigorously establish that gradient descent does not get stuck on saddle points Lee et al. (2016) but merely slowed down. Other notable recent contributions are Kawaguchi (2016), which further develops the spin-glass connection from Choromanska et al. (2015) and resolves the linear case by showing that no poor local minima exist; Sagun et al. (2014) which also ∗Currently on leave from UC Berkeley.", "startOffset": 78, "endOffset": 771}, {"referenceID": 6, "context": "discusses the impact of stochastic vs plain gradient, Soudry & Carmon (2016), that studies Empirical Risk Minimization for piecewise multilayer neural networks under overparametrization (which needs to grow with the amount of available data), and Goodfellow et al. (2014), which provided insightful intuitions on the loss surface of large deep learning models and partly motivated our work.", "startOffset": 247, "endOffset": 272}, {"referenceID": 6, "context": "discusses the impact of stochastic vs plain gradient, Soudry & Carmon (2016), that studies Empirical Risk Minimization for piecewise multilayer neural networks under overparametrization (which needs to grow with the amount of available data), and Goodfellow et al. (2014), which provided insightful intuitions on the loss surface of large deep learning models and partly motivated our work. Additionally, the work Safran & Shamir (2015) studies some topological properties of homogeneous nonlinear networks and shows how overparametrization acts upon these properties, and the pioneering Shamir (2016) studied the distribution-specific hardness of optimizing non-convex objectives.", "startOffset": 247, "endOffset": 437}, {"referenceID": 6, "context": "discusses the impact of stochastic vs plain gradient, Soudry & Carmon (2016), that studies Empirical Risk Minimization for piecewise multilayer neural networks under overparametrization (which needs to grow with the amount of available data), and Goodfellow et al. (2014), which provided insightful intuitions on the loss surface of large deep learning models and partly motivated our work. Additionally, the work Safran & Shamir (2015) studies some topological properties of homogeneous nonlinear networks and shows how overparametrization acts upon these properties, and the pioneering Shamir (2016) studied the distribution-specific hardness of optimizing non-convex objectives.", "startOffset": 247, "endOffset": 602}, {"referenceID": 6, "context": "discusses the impact of stochastic vs plain gradient, Soudry & Carmon (2016), that studies Empirical Risk Minimization for piecewise multilayer neural networks under overparametrization (which needs to grow with the amount of available data), and Goodfellow et al. (2014), which provided insightful intuitions on the loss surface of large deep learning models and partly motivated our work. Additionally, the work Safran & Shamir (2015) studies some topological properties of homogeneous nonlinear networks and shows how overparametrization acts upon these properties, and the pioneering Shamir (2016) studied the distribution-specific hardness of optimizing non-convex objectives. Lastly, several papers submitted concurrently and independently of this one deserve note, particularly Swirszcz et al. (2016) which analyzes the explicit criteria under which sigmoid-based neural networks become trapped by poor local minima, as well as Tian (2017), which offers a complementary study of two layer ReLU based networks, and their learning dynamics.", "startOffset": 247, "endOffset": 808}, {"referenceID": 6, "context": "discusses the impact of stochastic vs plain gradient, Soudry & Carmon (2016), that studies Empirical Risk Minimization for piecewise multilayer neural networks under overparametrization (which needs to grow with the amount of available data), and Goodfellow et al. (2014), which provided insightful intuitions on the loss surface of large deep learning models and partly motivated our work. Additionally, the work Safran & Shamir (2015) studies some topological properties of homogeneous nonlinear networks and shows how overparametrization acts upon these properties, and the pioneering Shamir (2016) studied the distribution-specific hardness of optimizing non-convex objectives. Lastly, several papers submitted concurrently and independently of this one deserve note, particularly Swirszcz et al. (2016) which analyzes the explicit criteria under which sigmoid-based neural networks become trapped by poor local minima, as well as Tian (2017), which offers a complementary study of two layer ReLU based networks, and their learning dynamics.", "startOffset": 247, "endOffset": 947}, {"referenceID": 6, "context": "discusses the impact of stochastic vs plain gradient, Soudry & Carmon (2016), that studies Empirical Risk Minimization for piecewise multilayer neural networks under overparametrization (which needs to grow with the amount of available data), and Goodfellow et al. (2014), which provided insightful intuitions on the loss surface of large deep learning models and partly motivated our work. Additionally, the work Safran & Shamir (2015) studies some topological properties of homogeneous nonlinear networks and shows how overparametrization acts upon these properties, and the pioneering Shamir (2016) studied the distribution-specific hardness of optimizing non-convex objectives. Lastly, several papers submitted concurrently and independently of this one deserve note, particularly Swirszcz et al. (2016) which analyzes the explicit criteria under which sigmoid-based neural networks become trapped by poor local minima, as well as Tian (2017), which offers a complementary study of two layer ReLU based networks, and their learning dynamics. In this work, we do not make any linearity assumption and study conditions on the data distribution and model architecture that prevent the existence of bad local minima. The loss surface F (θ) of a given model can be expressed in terms of its level sets Ωλ, which contain for each energy level λ all parameters θ yielding a loss smaller or equal than λ. A first question we address concerns the topology of these level sets, i.e. under which conditions they are connected. Connected level sets imply that one can always find a descent direction at each energy level, and therefore that no poor local minima can exist. In absence of nonlinearities, deep (linear) networks have connected level sets Kawaguchi (2016). We first generalize this result to include ridge regression (in the two layer case) and provide an alternative, more direct proof of the general case.", "startOffset": 247, "endOffset": 1761}, {"referenceID": 13, "context": "When κ = 0, it has been shown in Saxe et al. (2013) and Kawaguchi (2016) that in this case, every local minima is a global minima.", "startOffset": 33, "endOffset": 52}, {"referenceID": 9, "context": "(2013) and Kawaguchi (2016) that in this case, every local minima is a global minima.", "startOffset": 11, "endOffset": 28}, {"referenceID": 9, "context": "Let us highlight that this result is slightly complementary than that of Kawaguchi (2016), Theorem 2.", "startOffset": 73, "endOffset": 90}, {"referenceID": 0, "context": "Incorporating regularization drastically changes the topology, and the fact that we are able to show connectedness only in the two-layer case with ridge regression is profound; we conjecture that extending it to deeper models requires a different regularization, perhaps using more general atomic norms Bach (2013). But we now move our interest to the nonlinear case, which is more relevant to our purposes.", "startOffset": 303, "endOffset": 315}, {"referenceID": 1, "context": "This difficulty is non-existent in the linear case and not easy to exploit in mean-field approaches such as Choromanska et al. (2015), and shows that in general we should not expect to obtain connected level sets.", "startOffset": 108, "endOffset": 134}, {"referenceID": 3, "context": "It is a form of n-width similar to Kolmogorov width Donoho (2006) and is also related to robust sparse coding from Tang et al.", "startOffset": 52, "endOffset": 66}, {"referenceID": 3, "context": "It is a form of n-width similar to Kolmogorov width Donoho (2006) and is also related to robust sparse coding from Tang et al. (2013); Ekanadham et al.", "startOffset": 52, "endOffset": 134}, {"referenceID": 3, "context": "It is a form of n-width similar to Kolmogorov width Donoho (2006) and is also related to robust sparse coding from Tang et al. (2013); Ekanadham et al. (2011).", "startOffset": 52, "endOffset": 159}, {"referenceID": 15, "context": "This is consistent with the overparametrization results from Safran & Shamir (2015); Shamir (2016) and the general common knowledge amongst deep learning practitioners.", "startOffset": 70, "endOffset": 84}, {"referenceID": 15, "context": "This is consistent with the overparametrization results from Safran & Shamir (2015); Shamir (2016) and the general common knowledge amongst deep learning practitioners.", "startOffset": 70, "endOffset": 99}], "year": 2017, "abstractText": "The loss surface of deep neural networks has recently attracted interest in the optimization and machine learning communities as a prime example of highdimensional non-convex problem. Some insights were recently gained using spin glass models and mean-field approximations, but at the expense of strongly simplifying the nonlinear nature of the model. In this work, we do not make any such assumption and study conditions on the data distribution and model architecture that prevent the existence of bad local minima. Our theoretical work quantifies and formalizes two important folklore facts: (i) the landscape of deep linear networks has a radically different topology from that of deep half-rectified ones, and (ii) that the energy landscape in the non-linear case is fundamentally controlled by the interplay between the smoothness of the data distribution and model over-parametrization. Our main theoretical contribution is to prove that half-rectified single layer networks are asymptotically connected, and we provide explicit bounds that reveal the aforementioned interplay. The conditioning of gradient descent is the next challenge we address. We study this question through the geometry of the level sets, and we introduce an algorithm to efficiently estimate the regularity of such sets on large-scale networks. Our empirical results show that these level sets remain connected throughout all the learning phase, suggesting a near convex behavior, but they become exponentially more curvy as the energy level decays, in accordance to what is observed in practice with very low curvature attractors.", "creator": "LaTeX with hyperref package"}, "id": "ICLR_2017_17"}