{"id": "ICLR_2017_58", "reviews": [{"review": "This paper provides an interesting idea to use the optimized MMD for generative model evaluation and learning. Starting from the test power, the authors justified the criterion. Moreover, they also provided an efficient implementation of perturbation tests for empirical MMD. \n\nPros:\n\n1) The criterion is principled which is derived from the test power. \n2) The criterion can be used to detect the difference template by incorporating ARD technique. \n3) By exploiting kernel in the objective, the generated algorithm, t-GMMN, training can be improved from the GMMN.\n\nCons:\n\n1) How to train the provided t objective is not clear. \n2) The algorithm is only tested on MNIST dataset as model criticism and learning objective. Comprehensive empirical comparison to the state-of-the-art criteria, e.g., log-likelihood, and other learning objectives is missing. ", "rating": "6: Marginally above acceptance threshold", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}, {"review": "A well written paper that proposes to use MMD to distinguish generated and reference data. The primary contribution of this paper is to derive a way to optimize the MMD kernels to maximize the test power of the two sample test. \n\nPros\n\nPrincipled approach; derivations start from first principles and the theoretical results will probably be applicable to other applications of two sample tests.\n\nWell written; puts the contributions and related approaches into context and explains connections to previous work; especially to GANs.\n\nCons: I don’t expect that this work will have a big impact in the field:\n\nThe two sample test are still quadratic in the number of samples. \n\nExperiments only on toy data sets and on binarized MNIST\n\nIt would be interesting to know in what way this approach fails on e.g. image data (or other complex, high dimensional data where neural network generalize well). I could imagine that the neural network based discriminators in GANs generalize better than kernel based MMD methods. I would like to see follow up work that investigates this in more detail (and potentially profes my intuition wrong).\n", "rating": "8: Top 50% of accepted papers, clear accept", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}, {"review": "This is an interesting paper containing three contributions:\n\n1) An expression for the variance of the quadratic-time MMD estimate, which can be efficiently minimized for kernel selection.\n\n2) Advanced computational optimizations for permutation tests for the quadratic MMD statistic.\n\n3) Crystal-clear examples on the importance of reducing the variance in two-sample testing (Figure 2)\n\nRegarding my criticisms,\n\n1) The conceptual advances in this submission are modest: the use of MMD to train generative models, as well as the importance of variance-reduction in MMD were already known.\n\n2) The quadratic-time MMD test may lead to a discriminator that is \"too good\" in practical applications. Since MMD quickly picks up on pixel-level artifacts, I wonder if its use would be possible to train generators properly on realistic (non-binarized) data. This of course could be addressed by regularizing (smoothing) the kernel bandwidths, and for sure raises an interesting question/trade-off in generative modeling. \n\nOverall, the submission is technically sound and well-written: I recommend it for publication in ICLR 2017.", "rating": "7: Good paper, accept", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}]}