{"id": "ICLR_2017_430", "reviews": [{"review": "This paper presents an anomaly-based host intrusion detection method. LSTM RNN is used to model the system-call sequences and the averaged sequence likelihood is then used to determine anomaly, which is the attack. This paper also compares an ensemble method with two baselines as classification model.\n+This is is well written and more of ideas are clearly presented.\n+It demonstrates an interesting application of LSTM sequential modeling to HIDS problem\n-The overall novelty is limited considering the major technical components like LSTM RNN and ensemble method are already established. \n-The contribution of the proposed ensemble method needs further evaluation because it is also possible to use ensemble ideas in kNN and kMC baselines.", "rating": "5: Marginally below acceptance threshold", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}, {"review": "The authors propose using an LSTM on a sequence of system calls to perform network intrusion detection (NIDS). The idea of using neural networks (in general) for NIDS is old [1]. The idea of using some sort of NN on top of a sequence of system calls for NIDS is published [2]. The idea of using LSTMs for NIDS is published [2]. The paper in [2] operates on counts of N-grams of system calls, rather than on the raw sequence, but that pre-processing does not seem \"heavy\" to me.\n\nOverall, the proposed system works as well as other proposed NIDS system, and the paper checks portability (which is good).\n\nBut, on the con side, I don't see this paper as adding a lot to the state-of-the-art in NIDS. Nor does is the paper well-matched to ICLR. I didn't learn a lot about representations from this paper: many people have thrown LSTM at sequence problems.\n\nTherefore, I think it's below threshold for ICLR. The authors may wish to submit to a security conference.\n\nReferences:\n1. Debar, Herve, Monique Becker, and Didier Siboni. \"A neural network component for an intrusion detection system.\" Research in Security and Privacy, 1992. Proceedings., 1992 IEEE Computer Society Symposium on. IEEE, 1992.\n2. Creech, Gideon, and Jiankun Hu. \"A semantic approach to host-based intrusion detection systems using contiguousand discontiguous system call patterns.\" IEEE Transactions on Computers 63.4 (2014): 807-819.\n3. Staudemeyer, Ralf C. \"Applying long short-term memory recurrent neural networks to intrusion detection.\" South African Computer Journal 56.1 (2015).", "rating": "5: Marginally below acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}, {"review": "In this paper a novel approach for anomaly detection is considered for the task of intrusion detection based on system call sequence.\nThe system call sequence is regarded as a language, and multiple lstm-rnn language models are trained and ensembled. \nDiversity in the ensemble is achieved by choosing different hyper parameters for each lstm-LM.\nThe combination of the LMs is done by averaging transformations of the likelihoods. \n\nI really like the fact that no attack data is used during training, and I like the LM and ensemble approach. \nThe only high level drawbacks I have are the following, which might have a simple answer as I'm not an expert in this field:\n\n- Relaying of system calls seems weak: If the attacker has access to some \"normal\" sequences of system calls, all she can fool the system by interleaving its malicious system calls with normal ones, in a way that will artificially raise the likelihood of the sequence. \n- A few lines covering other anomaly detection tasks, where RNNs are used, can be added to the introduction, to give a better idea about the novelty of the approach. \n", "rating": "8: Top 50% of accepted papers, clear accept", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}]}